<html>
<head>
<title>infovox4 - Geavahan&#269;ilgehus</title>
</head>
<body>
<p>
<a name="d0e1"></a>
<a name="d0e3">
<img src="images/image001.png" width="201" height="61" alt="Title: Dovddaldat. - Description: Acapela Group dovddaldat." /></a></p>

<p>Infovox4 - Geavahan&#269;ilgehus<br />
4. veršuvdna<br />
<a name="d0e22">Almmuhuvvon njuk&#269;amánu 22.b. 2015</a></p> 
<p>Copyright © 2013-2015 Acapela Group<br />
All rights reserved<br />
<a href="http://www.acapela-group.com/">http://www.acapela-group.com</a></p> 
<br /> 

<h1>
<a name="Introductiontoinfovox4"> </a>
<a name="_Toc413655729">Infovox4 oahpásmuvvan</a></h1> 
<p>infovox4: geavat vaikke gos ja goas!</p> 
<p>infovox4 lea muitosákki buvtta, mas lea gievrras SAPI teavsttas-hállamii mohtor, mii lea jo&#273;ánis ja jierbmás šearbmalogat. Dat &#269;áhká du lupmii ja dat dáhkida ahte don álohii leat gearggus geavahit dán dihtoris, juohke sajis vaikke goas. Infovox 4 leat don álohii gearggus rahpat ja beassat dihtorii mii geavaha Windowsa!</p> 
<p>infovox4 sáhtát geavahit teavsttas-hállamii-mohtora njuolgga muitosákkis, don sáhtát maid sajáiduhttit buktaga golmma dihtorii. Dan ma&#331;&#331;á go leat sajáiduhttán buktaga dihtorii, de it dárbbaš geavahit muitosákki dihtorii vai beasat geavahit Infovox4 teavsttas-hállamii-jienaid.</p>

<p>infovox4 leat guokte váldodoaimma: </p> 
<p>
<a name="d0e37"></a>
<a name="d0e38">· Mátkke teavsttas-hállamii mohtor maid sáhttá geavahit dihtoris ruovttus ja barggus.</a>
<br /> 
<br /> Infovox4 sáhttá sajáiduvvot eanemusat golmma dihtorii, das lea gievrras teavsttas-hállamii mohtor maid sáhttá geavahit ovttas SAPI4 ja SAPI5. Don sáhtát geavahit mohtora dihtoris du buoremus šearbmalogádin.</p> 
<p>
<a name="d0e43">· &#268;oavddus go leat mátkkis ja ii sáhte eará šearbmalogádiid geavahit. </a>
<br /> 
<br /> infovox4 beasat buot dihtoriidda nu ahte it dárbbaš ovdagihtii sajáiduhttit, iige dárbbaš hálddašeaddji vuoigatvuo&#273;at. Dát sisttisdoallá olu válljenvejolašvuo&#273;aid gaskal alla kvalitehta teavsttas-hállamiid-jienaid, o&#273;&#273;a Colibri jienaid main lea eanet dávggasvuohta ja jo&#273;ánat lohkan leaktu, SpeechCreator prográmma mainna beassá guldalit ja ráhkadit jietnafiillaid persovnnalaš geavahussii, ja NVDA šearbmalohkan beassan dihtii du dihtorii.</p> 
<p>Go geavahat infovox4 dihtoris mii heive SAPI Teavsttas-hállamii-mohtorii, de sáhtát maiddái válljet sajáiduhttit nuppástuhttima dihtorii, nu ahte teavsttas-hállamii mohtor doaibmá vel buorebut. </p> 
<p>infovox4 lea ollu gielat ja ollu jienat, main lea buorre kvalitehta.</p>

<table> 
<tbody>
<tr> 
<td> 
<p>
<a name="d0e55">
<img src="images/image002.jpg" width="19" height="19" /></a></p> </td> 
<td> 
<p>Ma&#331;&#331;il go bijat infovox4 dihtorii, de Windows ieš álggaha muitosákki ovttadagaid <em>infovox4 Launcher </em>ja <em>infovox4 USB.</em> Windows implementere kártema, danin leat bustávvat válljejuvvon jo Windowsas.</p> 
<p>Jos dus leat ovddežis máhpat dihtoris, de soaitá ahte infovox4 váldá geavahussii bustávva mii lea jo geavahusas eará fierpmádatstašuvnnas. Daga dán jus lea dákkár váttisvuohta:</p> 
<p>
<a name="d0e81"></a>
<a name="d0e82">1. Iská gu&#273;e stašuvnna bustávva infovox4 geavaha.</a></p> 
<p>
<a name="d0e85">2. Sihku infovox4.</a></p> 
<p>
<a name="d0e88">3. Bija eará bustávva stašuvdnii. Vállje eará bustávva mii ii leat seammá go mii geavahuvvui infovox4.</a></p> 
<p>
<a name="d0e91">4. Jáddat ja bija o&#273;&#273;asit ala dihtora</a></p> 
<p>
<a name="d0e94">5. Bija infovox4 dihtorii</a></p> 
<p>Ále geavat dán &#269;ovdosa, jus lea sáhka dihtora fysalaš ovttadagain, dego garraskearrus sáhka. </p> 
<p>Go lea sáhka fierpmádatstašuvnna bagadusain, de sáhtát geavahit Windows veahkki. </p> </td> </tr> </tbody></table>

<table> 
<tbody>
<tr> 
<td> 
<p>
<a name="d0e105">
<img src="images/image002.jpg" width="19" height="19" /></a></p> </td> 
<td>

<p>Infovox4 sáhttá dovddiiduvvot boot ovttadahkan, BIOS-válljemiid geažil. Vai ii geava ná, de rávvet váldit eret Infovox4 muitosákki ovdal go bijat dihtora o&#273;&#273;asit johtui. </p>
<p> </p></td> </tr> </tbody></table> 
<br /> 
<h1>
<a name="LaunchPad"></a>
<a name="_Toc413655730">infovox4 LaunchPad</a></h1> 
<p><em>infovox4 LaunchPad</em> lea váldoprográmma mii vuolgá johtui automáhtala&#269;&#269;at go infovox4 muitosákki lea biddjon dihtorii. Dán prográmmas sáhtát bidjat johtui eará infovox4 prográmmaid ja sáhtát ásahit paramehteriid mat gusket infovox4ii. </p>

<p>
<a name="d0e133">
<img src="images/image003.png" width="331" height="431" alt="Title: infovox4 šearbmagovva. - Description: LaunchPad váldogovva." /></a> </p> 
<p> LaunchPad váldogovva</p>

<p>Prográmmaid bijat johtui go deaddilat boalu váldogovas dahje jus válljet seammá lágan válljejumi <em>Reaidduid </em>fálus. </p> 
<h2>
<a name="TheLaunchPadsbuttons"></a>
<a name="_Toc413655731"></a>
<a name="_Ref413312270"></a>
<a name="_The_LaunchPad&#39;s_buttons"></a>LaunchPada boalut</h2> 
<p>Juohke prográmma mii gullá infovox4 páhkkii &#269;ilgejuvvo sierra kapihttaliin dán dokumeanttas. &#268;uovvovaš prográmmat fátmmastuvvojit: </p> 
<p>
<a name="d0e153"></a>
<a name="d0e154">· NVDA – reaidu mii lohká jitnosit dan mii lea šearpmas.</a>
<a name="d0e157"></a></p> 
<p>
<a name="d0e160">· </a>
<a href="#SpeechCreator">SpeechCreator</a> – geavat dán prográmma go áiggot teavstta &#269;uojahit dahje ráhkadit jietnafiillaid.</p> 
<p>
<a name="d0e168">· </a>
<a href="#PronunciationEditor">Pronunciation Editor</a> – reaidu mii diktá du rievdadit standárda jietnadeami.</p> 
<p>
<a name="d0e176">· </a>
<a href="#DownloadManager">Download Manager</a> – reaidu maid dárbbašat jienaid viežžamii, sajáiduhttimii ja o&#273;asmahttimii.</p> 
<p>
<a name="d0e184">· </a>
<a href="#VoiceManager">Voice Manager</a> – diktá du ásahit iežas jienaid infovox4 jienaid vuo&#273;ul go rievdadat iešgu&#273;ege paramehtariid. </p> 
<p>Gávdnjot vel golbma boalu infovox4 álggahanprográmmas prográmmaboaluid lassin. Dát gávdnojit vuolimu&#269;&#269;as govas. </p> 
<p><em>Heivehus ofelaš</em>– Jos dán deaddilat de rahpasa gulahallangovva gos sáhtát válljet mo háliidat geavahit infovox4 ja háliidatgo infovox4 geavahit muitosákki bokte dahje sajáiduhttit dan dihtorii. </p> 
<p><em>Bálkes olggos/heaittit</em> – geavat dán boalu go heaittihat LaunchPad. Jos geavahat LaunchPad muitosákki bokte, de heaittihuvvo infovox4 muitosággiovttadat dihtoris. Don sáhtát de váldit eret muitosákki dihtoris.</p> 
<p><em>?</em> – Jos deaddilat dán boalu de rahppo infovox4 Veahkki.</p> 
<h2>
<a name="TheLaunchPadsmenus"></a>
<a name="_Toc413655732">LaunchPada válljenvejolašvuo&#273;at</a></h2> 
<h3>
<a name="TheLaunchPadsmenusTools">Reaiddut</a></h3> 
<p><em>Reaidduid</em> fálus leat fáloš&#269;uoggát mat lea seammá go dat mat leat LaunchPad váldogovas, geah&#269;a 
<a href="#TheLaunchPadsbuttons">LaunchPada boaluid</a><em>.</em></p>

<h3>
<a name="TheLaunchPadsmenusSettings">Heivehusat</a></h3> 
<p>Geavat kommándoid mat leat dán fállosis heivehit ja hálddašit infovox4.</p> 
<h4>
<a name="TheLaunchPadsmenusGeneral">Oppalaš vuolit fálus</a></h4> 
<p>Oppalaš vuolit fállosis sáhtát dáid dahkat:</p> 
<p>
<a name="d0e239"></a>
<a name="d0e240">· Rievdadit lokaliserengiela. </a></p> 
<p>
<a name="d0e243">· Hálddašit báikkálaš infovox4 sajáiduhttima. Dát gáibida hálddašeaddji vuoigatvuo&#273;a.</a></p> 
<p>
<a name="d0e246">· Vállje ovtta válljejumiin mat leat olámuttos LaunchPadas ja vállje dahkama go bijat infovox4 muitosákki dihtorii. </a></p> 
<h4>
<a name="TheLaunchPadsmenusVoice">Jiena vuolit fálus</a></h4> 
<p>Jietnafállosis sáhtát dahkat dáid: </p> 
<p>
<a name="d0e260"></a>
<a name="d0e261">· Vállje infovox4 jiena maid áiggut geavahit ovttas šearbmalogádiin. </a></p> 
<p>
<a name="d0e264">· Válljet jiena maid leat aiddo geavahan.</a></p> 
<p>
<a name="d0e267">· Vállje ovtta molssaeavttu maid sáhttá válljet šearbmalogádis, ja die&#273;it mo galgá doaibmat go bijat infovox4 muitosákki dihtorii.</a></p> 
<p>
<a name="d0e270">· Aktivere dahje heaittiha vuostáiváldindearvvahusa.</a></p> 
<p>
<a name="d0e273">· Álggat vuostáiváldindearvvahusa doaimmahanprográmma, das gos sáhtát bidjat dearvvahusa, mii galgá &#269;ájehuvvot go bijat johtui LaunchPada, ja vállje jiena mii lohká vuostáiváldindearvvahusa.</a></p> 
<h4>
<a name="TheLaunchPadsmenusPLI"> PLI vuolit fálus</a></h4> 
<p>“PLI”, <em>Permanent Local Installation, </em> mearkkaša ahte don geavahat infovox4, mii lea sajáiduvvon dihtorii. Jos galgá doaibmat muitosákki haga, de gáibida PLI liseanssa. Dárbbašlaš liseansa dábála&#269;&#269;at fievrriduvvo automáhtala&#269;&#269;at infovox4 muitosákkis, go sajáiduhtát infovox4, muhto sáhttá maiddái fievrridit ieš infovox4 muitosákkis vaikke goas. <em>PLI </em>fállosis sáhtát hálddašit PLI liseanssa. Sáhtát dahkat ná:</p> 
<p>
<a name="d0e292"></a>
<a name="d0e293">· Fievrrit PLI liseanssa dihtorii.</a></p> 
<p>
<a name="d0e296">· Fievrrit ruovttoluotta PLI liseanssa dihtoris infovox4 muitosággái.</a></p> 
<p>
<a name="d0e299">· Iská PLI liseanssa stáhtusa. Dás spesifisere man galle liseanssa lea olámuttos ja leago PLI liseansa olámuttos du dihtoris.</a></p> 
<h4>
<a name="TheLaunchPadsmenusBackup">Sihkkarastinmá&#331;gosa vuolitfálus</a></h4> 
<p>Kommándot mat leat olámuttos addet vejolašvuo&#273;a váldit sihkkarastinmá&#331;gosa ja máhcahit iežat infovox4 USB muitosákki. Gulahallangovas leat guokte molssaeavttu maid dát kommándo rahpá. Kommándo <em>Geargan </em>gok&#269;á infovox4 prográmma ja geavaheaddjiválljemiid. Kommándo <em>geavaheaddjidáhta</em> váikkuhit dušše geavaheaddjispesifihkka dáhtai. </p> 
<h4>
<a name="TheLaunchPadsmenusSAPI">SAPI vuolitfálus</a></h4> 
<p>Dás sáhtát aktiveret SAPI mohtora. Don sáhtát aktiveret SAPI4, SAPI5 dahje goappašagaid. Dát gáibida hálddašeaddji vuoigatvuo&#273;a. It dárbbaš aktiveret SAPI jos leat infovox4 sajáiduhttán dihtorii. Dát aktiverejuvvo automáhtala&#269;&#269;at. </p> 
<h3>
<a name="TheLaunchPadsmenusHelp">Veahkki</a></h3> 
<p>Veahkki-fállosis leat dát válljejumiid:</p> 
<p>
<a name="d0e332"></a>
<a name="d0e333">· Jos válljet <em>Die&#273;ut</em> vuolitfállosis de rahpasa gulahallangovva mii &#269;ájeha infovox4 die&#273;uid ja stáhtusa. Ovdamearkka dihtii &#269;ájehuvvo infovox4 USB ráidonummir. Jos deaddilat <em>Má&#331;ge &#269;uohpusbeavdái </em>de má&#331;gejuvvo diehtu Windowsa &#269;uohpusbeavdái, ja sisdoalu sáhttá bidjat dokumentii dahje e-postii. Dát doaibma sáhttá leat ávki veahkki dáfus. </a></p> 
<p>
<a name="d0e342">· Kommándo <em>Liseansašiehtadus </em> &#269;ájeha liseansaeavttuid maid fertet dohkkehit ovdalgo beasat geavahit</a> infovox4. 
<a name="d0e348"></a></p> 
<p>
<a name="d0e354">· Kommándo <em>Automáhtala&#269;&#269;at iská jos gávdnojit o&#273;asmahttimat vuolggahettiin </em>iská leat go o&#273;asmahttimat infovox4 LaunchPad olámuttos. Jos leat o&#273;asmahttimat prográmmadáhtas de oažžut die&#273;u LaunchPad álggahettiin.</a></p> 
<p>
<a name="d0e360">· Jos válljet <em>Iská jos gávdnojit o&#273;asmahttimat </em>de iská leatgo prográmmadáhta o&#273;asmahttimat olámuttos. Don sáhtát geavahit dán kommándo vaikke goas.</a></p> 
<br /> 
<h1>
<a name="DownloadManager"></a>
<a name="_Toc413655733"></a>
<a name="_Ref413309089"></a>
<a name="_Download_Manager"></a>Download Manager</h1> 
<p><em>Infovox4 Download Manger</em> lea prográmma mii veahkeha doaimmahit infovox4 jienaid. Váldogovas leat jienat maid sáhtát geavahit. </p>

<p>
<a name="d0e377">
<img src="images/image004.png" width="538" height="251" alt="Title: infovox4 šearbmagovva. - Description: Download Managera váldogovva." /></a> </p> 
<p>Download Managera váldogovva</p> 
<p>Juohke jienas lea árvu mii muitala nama, giela, teknologiija, sohkabeali, sajáiduhttinstáhtusa, veršuvdnanummira ja válljejuvvon doaimma.</p> 
<p><em>Teknologiija </em>&#269;ájeha ovtta dáid árvvuin<em> HQ</em>-, <em>HD</em>- dahje <em>Colibri</em>-árvvu.</p> 
<p>
<a name="d0e403"></a>
<a name="d0e404">· <em>HQ</em></a>: Lea teavsttas-hállamii mas lea alla kvalitehta (High Quality). Das lea lunddolaš ja vuogas jietna, mii heive lohkat guhkebuš teavsttaid, go das lea buoret ovdanbuktin vuohki. Nuohttaallodaga ja nuohttaallodaga dynamihka ii sáhte rievdadit HQ-jienain. </p> 
<p>
<a name="d0e409">· <em>HD</em></a>: Hihg Density teavsttas-hállamii geavaha boarrásat teknologiija mas lea eanet mašiinna ja geardduheapmi nuohtta. HD jienain sáhttá rievdadit nuohttaallodaga ja nuohttaallodaga dynamihka.</p> 
<p>
<a name="d0e414">· <em>Colibri</em></a>: Colibri jienat leat hui sihkkaris ja gievrras jienat. Dain lea HQ-jienaid vuo&#273;&#273;u main lea seammá namma. Jietnakvalitehta ii leat nu lunddolaš, muhto dáin lea eanet fleksibilitehta, mii dagaha ahte jienat heivejit buorebut lohkat oanehis cealkagiid, ja maiddái guhkibuš teavsttaid jo&#273;áneabbo lohkanleavttuin. Colibrin sáhttá rievdadit nuohttaallodaga ja nuohttaallodaga dynamihka.</p> 
<p>Go deaddilat skájangova mii lea juohke jienas, de &#269;uojahuvvo ovdamearka válljejuvvon jienas.</p>

<h2>
<a name="Performingactionsonthevoice"></a>
<a name="_Toc413655734"></a>
<a name="_Ref413312414">Jienaid doaimmaid &#269;a&#273;aheapmi</a></h2> 
<p>Infovox4 liseansa mearrida makkár jienat &#269;ájehuvvojit jietnalisttus. Don sáhtát oažžut beassanlobi, doaimmahit ja geavahit jienaid. Liseansatiipa &#269;ájehuvvo govas vuolimusas olgeš &#269;iegas. </p> 
<p>Don sáhtát viežžat, sajáiduhttit, sihkkut ja &#269;a&#273;ahit o&#273;asmahttimiid dán prográmma bokte. Proseassa lea guovtti oasis. </p> 
<p> <strong>Mo válljet doaimmaid jienaide?</strong></p> 
<p>Álggos ferte spesifiseret doaimma ovtta dahje eanet jienaide. Don sáhtát válljet gaskal <em>Sajáiduhte, O&#273;asmahte, Sihko </em>ja <em>Ii oktage </em>(ii makkárge doaimma). Válljejumi sáhttá dahkat má&#331;gga láhkai. Vállje dan mii dutnje heive buoremusat. </p> 
<p>
<a name="d0e447"></a>
<a name="d0e448">1. Vállje jiena ja geavat jo&#273;ánisfálu. Go deaddilat olgeš bealde sáhpána de ihtet jiena hearbevárit. Vállje dan maid háliidat.</a></p> 
<p>
<a name="d0e451">2. Vállje jiena ja deaddil vaikke gu&#273;e boalu mii lea vuolimusas váldogovas. Boalut maid ii sáhte geavahit jitnii, eai leat aktiiva. Deaddil ovtta boaluin mat leat aktiiva. </a></p> 
<p>
<a name="d0e454">3. Vállje jiena ja juoidá eará fállosis. Doaimmat mat eai gusto válljejuvvon jitnii eai leat aktiiva. Geavat fállokommándoid geavahettiin njuolaid dahje <em>Alt</em>-kommándo, doala<em> Alt</em>-boalu vuollin ja deaddil bustávva mii gusto fállo&#269;uoggá</a>.</p> 
<p>
<a name="d0e463">4. Deaddil guktii gustovaš doaimma. Árvu rievdá nubbái mii lea gustovaš. Jos deaddilat guktii ma&#331;&#331;álagaid de molsu árvvu dasa mii lea álgoálggus. </a></p> 
<p>Go leat bidjan barggu johtui de rahpasa gulahallanboksa mii jearrá háliidat go dahkat barggu vajot. Jos deaddila <em>Juo-</em>boalu, de vuolgá bargu johtui vajot. Jos it áiggu eará barggu bidjat johtui, de lea buorre jos válljet Juo. Jos áiggot bidjat má&#331;ga barggu johtui, de lea vuogas vurket daid ”vuordi bargun” ja bidjat de easkka buot bargguid johtui go leat válljen buot bargguid maid áiggut bidjat johtui. Jos válljet dahkat ná, de deaddil <em>Ii</em> boalu. Merke <em>ále jeara o&#273;&#273;asit-</em>bovssa jos it hálit ahte dát gulahallanboksa boahtá oidnosii álohii go válljet o&#273;&#273;a barggu. </p> 
<p>Jos deaddilat <em>Ii</em>-boalu de joatkkát válljet bargguid eará jienaide. Barggut biddjojit buot “vuordi bargguide”. </p> 
<p>Deaddil <em>Álggat bargguid </em>dahje vállje vuolitfálus <em>Fiila</em>-fálus <em>Álggat bargguid. </em></p> 
<p>Lea maiddái vejolaš válljet má&#331;ga jiena jos geavahat <em>Shift-</em> dahje <em>Ctrl</em>-boaluid ja válljet de barggu mii gusto buot válljejuvvon jienaide. Ovdamearkka dihte jos háliidat váldit eret jienaid, de it dárbbaš dahkat dan ovtta ja ovtta jiena ovddas. Vállje jienaid maid áiggut váldit eret, ja deaddil <em>Váldde eret </em>ja <em>Álggat bargguid. </em></p> 
<p>Jos jienaide ii leat válljejuvvon barggut, ja gávdnojit jienat mat dárbbašit o&#273;asmahttima, de &#269;ájeha <em>Álggat bargguid </em>boallu teavstta <em>O&#273;asmahte jiena(id). </em>Jos eai leat barggut maid sáhttá válljet, eaige leat jietnao&#273;asmahttimat de lea boallu ránes, iige sáhte deaddilit dan.</p>

<h2>
<a name="Changingtheview"></a>
<a name="_Toc413655735"></a>
<a name="_Ref413312537">Rievdadit &#269;ájeheami</a></h2> 
<p>Sáhtát molsut jienaid &#269;ájeheami mat leat váldogova listtus. Dán dárkkistat <em>&#268;ájeheami-</em>fálus dahje listtus mii lea jietnalisttu bajábealde. Sáhtát geavahit sihke sille- ja sirrendoaimmaid oažžun dihte &#269;ájeheami maid háliidat. </p> 
<h3>
<a name="Filteringthevoiceview">Sirret jietna&#269;ájeheami</a></h3> 
<p>Lea vejolaš sirret jienaid mat leat váldogovas, jos geavahat vuolitfállosii <em>Sirre </em>ja <em>&#268;ájet &#268;ájeheami </em>fállosis, dahje jos válljet rievttes árvvuid listtus mii lea bajábealde jietnalisttu. Vállje vuos sirrenmolssaeavttu. Sáhttá sirret jienaid giela, sohkabeali ja sajáiduhttin stáhtusa hárrái. Ma&#331;&#331;il go leat válljen sirrenárvvu, vállje ovtta <em>&#268;ájet</em>-árvvu. Árvvut &#269;ájehuvvojit iešgu&#273;et sirrenmolssaeavttuin. </p> 
<p>Ovdamearka: </p> 
<p>Háliidat ahte dušše fránska jienat galget &#269;ájehuvvot listtus. Vállje <em>Giela</em> sirrenmolssaeaktun listtus <em>Sirre &#268;ájeheapmi</em>-fállosis, <em>&#268;ájeheapmi&#8594;Sirre&#8594;Giella. </em>Vállje <em>fránskkagiela </em>listtus dahje <em>&#268;ájeheapmi</em>-fállosis, <em>&#268;ájeheapmi&#8594;&#268;ájet&#8594;fránskkagiella</em>.</p> 
<h3>
<a name="Sortingthevoices">Sirret jienaid</a></h3> 
<p>Sáhttá sirret jienaid ortnetvuoru, go deaddila jietnalisttu bajil&#269;állaga dahje jos válljet fálus <em>&#268;ájeheapmi&#8594;Sirre </em>ja válljet ovtta árvvu mii lea dás. Doaibmaárvvut leat sirrejuvvon standárda ortnetvuorus. Sáhttá rievdadit dán jos deaddilat njuollamearkka mii oidno ceakko&#269;uoldda bajil&#269;állaga olgeš bealde, <em>Bargga</em>.</p>

<h2>
<a name="DownloadManagerThemenus"></a>
<a name="_Toc413655736">Válljenvejolašvuo&#273;at</a></h2>

<table> 
<tbody>
<tr> 
<td> 
<p>
<a name="d0e582"><strong>Fiila</strong></a></p> </td> 
<td> 
<p><em>Sajáiduhte jiena fiillas</em> – geavat dán jos dus lea sajáiduhttin jietna fiila. </p> 
<p><em>Álggat bargguid</em> – dát kommándo álggaha jienaid bargguid, earret eará sajáiduhttima, o&#273;asmahttima, váldit eret dahje ii ovttage barggu. </p> 
<p><em>Heaittit</em> – geavat dán go heaittihat Download Managera. </p> </td> </tr> 
<tr> 
<td> 
<p><strong>&#268;ájet</strong></p> </td> 
<td> 
<p>Dat mat dás gávdnojit leat &#269;ilgejuvvon 
<a href="#Changingtheview">Rievdadit &#269;ájeheami</a>.</p> </td> </tr> 
<tr> 
<td> 
<p><strong>Barggut</strong></p> </td> 
<td> 
<p><em>Raba die&#273;uid</em> – dát kommándo &#269;ájeha bovssa gos leat die&#273;ut jiena birra maid leat válljen jietnalisttus. </p> 
<p><em>&#268;uojat ovdamearkka</em> – dát kommándo &#269;uojaha jietnalisttus válljejuvvon jiena sánádaga ovdamearkka.</p> 
<p><em>Bisset</em> – Bisseha &#269;uojaheami mii lea vuolggahuvvon kommándos <em>&#269;uojat ovdamearkka</em>.</p> 
<p><em>Ii oktage</em>, <em>sajáiduhte</em>, <em>o&#273;asmahte</em>, ja <em>váldde eret</em> leat &#269;ilgejuvvon 
<a href="#Performingactionsonthevoice">Jienaid doaimmaid &#269;a&#273;aheapmi</a>. </p> </td> </tr> 
<tr> 
<td> 
<p><strong>Veahkki</strong></p> </td> 
<td> 
<p>infovox4 Download Manager veahkki – rahpá Veahkki </p> 
<p><em>Die&#273;ut</em> – dát kommándo rahpá Download Manager die&#273;uid bovssa</p> </td> </tr> </tbody></table> 
<br /> 
<h1>
<a name="SpeechCreator"></a>
<a name="_Toc413655737"></a>
<a name="_Ref413315946"></a>
<a name="_Ref413309024"></a>
<a name="_SpeechCreator"></a>SpeechCreator</h1> 
<h2>
<a name="TheSpeechCreator"></a>
<a name="_Toc413655738">SpeechCreator</a></h2>

<p>
<img src="images/image005.png" width="538" height="347" alt="Title: infovox4 šearbmagovva. - Description: SpeechCreator váldogovva." /></p> 
<p>SpeechCreator váldogovva</p>

<p>Infovox4 SpeechCreator &#269;ájeha teavsttas-hállamii-mohtora doaimmaid nama, prográmmas leat má&#331;ga dábálaš doaimma standárda teavsttas-hállamii-klienttas. Prográmma váldodoaimmat lea namuhuvvon dás: </p> 
<p>
<a name="d0e744"></a>
<a name="d0e745">· Lohká jitnosit buotlágan teakstafiillaid dahje teavstta mii &#269;állo njuolgga SpeechCreator govvii, jienain mii lea infovox4is.</a></p> 
<p>
<a name="d0e748">· Lea vejolaš konverteret teakstafiillaid mp3 fiilan.</a></p> 
<p>
<a name="d0e751">· Boa&#273;a infovox4 Voice Manager ja Pronunciation Editor</a></p> 
<p>
<a name="d0e754">· Geah&#269;&#269;ala SAPI mearkkaid</a></p> 
<p>SpeechCreator govas lea guoros dokumeantagovva. Dása sáhtát &#269;állit teavstta (dahje rahpat teakstafiilla) maid sáhtát &#269;uojahit infovox4is.</p>

<h2>
<a name="TheMenus"></a>
<a name="_Toc413655739">Válljenvejolašvuo&#273;at</a></h2> 
<h3>
<a name="TheFilemenu">Fiila fálus</a></h3> 
<p>
<a name="d0e783"></a>
<a name="d0e784">· Geavat O&#273;&#273;a kommándo go ráhkadat o&#273;&#273;a teaksta fiilla. Guoros dokumeanta gova ihtá, maid sáhttá geavahit.</a></p> 
<p>
<a name="d0e790">· Geavat Raba kommándo rahpat fiilla.</a> Gulahallanboksa Raba fiilla &#269;ájehuvvo. Deaddil guktii fiilla maid áiggut rahpat, de &#269;ájeha dokumeantagova sisdoallu. SpeechCreator sáhttá rahpat <em>txt</em> ja <em>rtf</em> fiilaformáhtaid.</p> 
<p>
<a name="d0e805">· Geavat Vurke go áiggut vurket fiillaid. Jos vurket fiillaid eará namain, de vállje vurke ná.</a></p> 
<p>
<a name="d0e814">· Geavat kommándo Heaittit jos áiggot heaitit geavaheamen SpeechCreatora.</a></p> 
<h3>
<a name="TheEditmenu">Doaimmat fálus</a></h3> 
<p>
<a name="d0e826"></a>
<a name="d0e827">· Don sáhtát doaimmahit teavstta rabas dokumeanttas dábálaš vuogi mielde, gos geavahat kommándoid Gá&#273;a, Daga o&#273;&#273;asit, &#268;uohpa, Má&#331;ge ja Liibme doaimmaheaddji fállosis.</a></p> 
<p>
<a name="d0e848">· Geavat kommándo Merke buot doaimmaheaddji fállosiin go áiggot merket olles teavstta aktiivva dokumeanta govas.</a></p> 
<p>
<a name="d0e857">· Kommándo Molsso fokusa Reaidoholgii molsu fokusa reaidoholggas teakstagovii-, jos reaidoholga lea aktiiva. Fokus molsojuvvo nuppi guvlui jos teakstagovva lea aktiiva.</a></p> 
<h3>
<a name="TheOptionsmenu">Molssaeavttuid fálus</a></h3> 
<p>
<a name="d0e869"></a>
<a name="d0e870">· <em>Fonta...</em></a> kommándo geavahuvvo válljet fontta tiippa, sturrodaga ja stiilla. Kommándo rahpá o&#273;&#273;a gova gos molssaeavttuid sáhttá válljet.</p> 
<p>
<a name="d0e876">· Jos Automáhtalaš bajil&#269;álaáican lea válljejuvvon, de biddjo &#269;uokkis juohke automáhtala&#269;&#269;at juohke linjái mii ii loahpahuvvo &#269;uoggáin. Dán láhkai lohkkojit bajil&#269;állagat, listtut jna. rivttes intonašuvnnain.</a>
<br /> Ovdamearkka dihtii lohko bajil&#269;ála cealkagiin jos ii leat dát molssaeaktu válljejuvvon. Jos ii leat válljejuvvon de bajil&#269;ála ii rehkenastojuvvo cealkagiin. Bajil&#269;ála lohko oktan teavsttain mii boahtá bajil&#269;állaga vuolábealde.
<br /> Molssaeaktu lea aktiverejuvvon standárdii. </p> 
<p>
<a name="d0e886">· Molssaeaktu <em>Geavat merkejuvvon teavstta </em>mearrida mo teaksta dulkojuvvo.</a>
<br /> Jos háliidat geavahit Microsoft Speech API dárkkistan boaluid teavsttas, de vállje dán molssaeavttu. 
<br /> Ovdamearka merkejuvvon teavsttas:
<br /> \Spd=100\ Dál hálan dábálaš láhkai, \Spd=150\ dál hálan veaháš njoazebut, fargga hálan \Spd=40\ hui njozet!
<br /> Eanet die&#273;uid gávnnat 
<a href="#TextTags">Teakstamearkkat</a> teavsttas.</p> 
<p>Seammá bohtosa oažžut jos merket Geavat merkejuvvon teavstta bovssa SpeechCreator váldogovas. Jos ii leat válljejuvvon dát molssaeaktu, de Microsoft Speech API dárkkistanmearkkat dulkojit teavstta dábálaš teastan ja de lohkojuvvo nu. </p> 
<p>
<a name="d0e916">· <em>Unicode-fiillaid</em></a> molssaeavttu válljet go rahpá Unicode-fiilla. Jos ii válljejuvvo de dulkojuvvo rabas fiila standárda kodan ja jietna mii lea SpeechCreators aktiiva geavahuvvo. 
<br /> Geavat maiddái dán molssaeavttu jos háliidat vurket teavstta maid leat bidjan SpeechCreator Unicode-fiilan. Standárda koda lea mii de lea dan jiena standárda. </p> 
<h3>
<a name="ThePlaymenu">&#268;uojat fálus</a></h3> 
<p>
<a name="d0e930"></a>
<a name="d0e931">· Geavat <em>&#268;uojat</em> kommándo vai teaksta mii lea govas lohkko jitnosit. SpeechCreator automáhtala&#269;&#269;at lohká teavstta álggus fiillas. Jos háliidat dušše gullat teavstta dihto sajiin, de merke dán oasi ovdal deaddilat<em> &#268;uojat</em>. </a></p> 
<p>
<a name="d0e943">· Go lohkanproseassa lea jo&#273;us, de sáhtát bissehit lohkama jos deaddilat <em>Bisset</em>. Sáhtát maid deaddilit <em>Gaskkalduhte</em>, jos háliidat gaskkalduhttit lohkama. Lohkan joatká go deaddilat <em>&#268;uojat</em> boalu.</a></p> 
<p>Sáhtát maid geavahit jo&#273;ánis boaluid kommándoide mat lea namuhuvvon dás bajábealde: </p>

<table> 
<tbody>
<tr> 
<td> 
<p>
<a name="d0e966">&#268;uojat</a></p> </td> 
<td> 
<p><strong>F2</strong></p> </td> </tr> 
<tr> 
<td> 
<p>Gaskkalduhte</p> </td> 
<td> 
<p><strong>F3</strong></p> </td> </tr> 
<tr> 
<td> 
<p>Bisset</p> </td> 
<td> 
<p><strong>F4</strong></p> </td> </tr> </tbody></table> 
<h3>
<a name="TheToolsmenu">Reaidduid fálus</a></h3> 
<p>
<a name="d0e1016"></a>
<a name="d0e1017">· Kommándo <em>Pronunciation Editor</em> Reaidduid fállosis rahpá Pronunciation Editor. Geah&#269;a kapihttala </a>
<a href="#PronunciationEditor">Pronunciation Editor</a> eanet die&#273;uid dán prográmma birra. </p> 
<p>
<a name="d0e1035">· Kommándo <em>Voice Manager </em>Reaidduid fállosis rahpá infovox4 Voice Manager prográmma. Geah&#269;a kapihttala </a>
<a href="#VoiceManager">Voice Manager</a> eanet die&#273;uid dán prográmma birra.</p> 
<h3>
<a name="TheHelpmenu">Veahkki fálus</a></h3> 
<p>
<a name="d0e1053"></a>
<a name="d0e1054">· Geavat kommándo <em>Sisdoallu</em> Veahkki fállosis dahje geavat <strong>F1 </strong>rahpat Veahkki fállosa.</a></p> 
<p>
<a name="d0e1069">· <em>Die&#273;ut SpeechCreator birra...</em></a> Kommándo rahpá Veahkki fállosis Die&#273;ut bovssa mas leat die&#273;ut SpeechCreator birra. </p> 
<h2>
<a name="Selectingavoice"></a>
<a name="_Toc413655740">Jietnaválljen</a></h2> 
<p>Jos háliidat válljet eará jiena lohkat teavsttas, geavat jietnalisttu mii lea olgeš bealde doaimmaheaddji gova.</p> 
<h2>
<a name="Creatingspeechfiles"></a>
<a name="_Toc413655741">Ráhkadit jietnafiillaid</a></h2> 
<p>SpeechCreator diktá du ráhkadit jietnafiillaid mp3 fiilaformáhttii.</p>

<table> 
<tbody>
<tr> 
<td> 
<p>
<a name="d0e1091">
<img src="images/image006.jpg" width="19" height="19" /></a></p> </td> 
<td> 
<p>Mearkkaš:</p> 
<p>Don sáhtát geavahit infovox4 dahje eará jietnafiilla mii doaibmá infovox4 jietnan, iežas geavahussii. It sáhte geavahit infovox4 jietnafiillaid kommersiála prográmman, almmola&#269;&#269;at, viidásit vuovdit dahje sáttagiin.</p> 
<p>Oaidnit infovox4 geavaheaddjiliseanssa raba infovox4 LaunchPada, vállje <em>Veahkki&#8594;Liseansa šiehtadus...</em></p>
<p> </p></td> </tr> </tbody></table> 
<p>Buot teavsttat mat rahppojit SpeechCreator-doaimmahangovas sáhttá konverteret mp3 jietnafiilan. </p> 
<p>Daga ná go rahkadat jietnafiilla:</p> 
<p>
<a name="d0e1124"></a>
<a name="d0e1125">1. Raba teavstta SpeechCreator doaimmahan govas dahje raba teakstafiilla maid hálliidat konverteret jietnan. Jos it hálit buot teavstta konverteret, de vállje teakstabihtá maid áiggot geavahit. </a></p> 
<p>
<a name="d0e1128">2. Vállje jiena jietnalisttus.</a></p> 
<p>
<a name="d0e1131">3. Iská leago jietnaleaktu nu go háliidat.</a></p> 
<p>
<a name="d0e1134">4. Guldal teavstta go deaddilat <em>&#268;uojat</em> boalu. Dát dahká ahte beasat dohkkehit ahte SpeechCreator heivehusat leat nu go galget leat.</a></p> 
<p>
<a name="d0e1140">5. Álggat konverterema go válljet kommándo Fiila fállosis <em>Olggosfievrrit MP3:n</em> Dát álggaha gulahallan bovssa.</a></p> 
<p>
<a name="d0e1149">6. Spesifisere fiilabohtosa gulahallan bovssas.</a></p> 
<p>
<a name="d0e1152">7. Jos leat merken teavstta doaimmahangovas de iská <em>Dušše válljejuvvon teaksta </em>bovssa<em>. </em>Mu&#273;ui buot teaksta konverterejuvvo jietnafiilan. Jos ii leat teaksta merkejuvvon SpeechCreator doaimmahan govas, dát válljen lea seavdnjat. </a></p> 
<p>
<a name="d0e1158">8. Standárda mearri mp3 fiillas lea 128. Sáhtát válljet eará árvvu Bihttámearri listtus.</a></p> 
<p>
<a name="d0e1164">9. Jos deaddilat <em>Olggosfievrrit</em> de ráhkadišgoahtá mp3 jietnafiillaid.</a></p> 
<h2>
<a name="Troubleshooter"></a>
<a name="_Toc413655742">Boasttuvuo&#273;aohcandoaibma</a></h2> 
<h3>
<a name="Errormessageatstartup">Meattáhusdiehtu prográmma álggaheamis</a></h3> 
<p>Jos boahtá meattáhusdiehtu go álggahat infovox4 SpeechCreator, de dás sáhttet leat guokte siva: </p> 
<p>
<a name="d0e1178"></a>
<a name="d0e1179">· Dus ii leat fámus liseansa.</a></p> 
<p>
<a name="d0e1182">· Jietnakoarta ii leat konfigerejuvvon riekta. Dát geavvá dávjá go geavaha má&#331;ggaid jietnavuolggaheddjiid, dávjá doibmet dát ovttas <em>Soundblasterin. </em> Go geavahat infovox4, de ferte leat dus rievttes vuolggaheaddji mii gullá du jietnakortii. Váttisvuohta sáhttá leat ahte muhtun doaimmain (go &#269;uojaha WAV dahje MP3 fiillaid) sáhttá jietnavuolggaheaddji doaibmat, muhto eará jietnadoaimmain ii fas. Dakkárat main ferte geavahit SAPI ferte leat albma jietnavuolggaheaddji. </a></p> 
<h3>
<a name="Nosoundfromtheloudspeakers">Skájaniin ii boa&#273;e jietna</a></h3> 
<p>Jos leat &#269;állán teavstta dokumeantagovvii ja deaddilan &#268;uojat, muhto ii gullo jietna skájaniin, de iská dáid: </p> 
<p>
<a name="d0e1197"></a>
<a name="d0e1198">· Ahte skájanat leat alde;</a></p> 
<p>
<a name="d0e1201">· Ahte Windowsa jietna lea bajiduvvon;</a></p> 
<p>
<a name="d0e1204">· Raba <em>Reaidduid</em> fállosa ja vállje Voice Manager, dárkkis ahte jietna lea biddjon ala (mearkkaš ahte infovox4 doaibmá ovttas Windows WAVE jietnadárkkistemiin.)</a>;</p> 
<br /> 
<h1>
<a name="VoiceManager"></a>
<a name="_Toc413655743"></a>
<a name="_Ref413316064"></a>
<a name="_Ref413312925"></a>
<a name="_Ref413309122"></a>
<a name="_Voice_Manager"></a>Voice Manager</h1> 
<p>Voice Manager lea prográmma mii addá vejolašvuo&#273;a heivehit infovox4-jienaid. Don válljet jiena mii lea álgoálgosaš infovox4is ja ráhkadat o&#273;&#273;a jiena dás. Sáhtát heivehit jiena go rievdadat dan heivehusaid. Go leat duhtavaš jiena heivehusain, de vurket jiena o&#273;&#273;a heivehuvvon jiena. Jietna maid ieš leat heivehuvvon, goh&#269;oduvvo heivehuvvon jietnan. Buot prográmmat mat geavahit infovox4, bidjet de heivehuvvon jiena eará jienaid listui. </p> 
<p>Álggat Voice Manager infovox4 LaunchPadas. Prográmma sáhttá maid álggahuvvot SpeechCreator bokte.</p> 
<h2>
<a name="TheMainWindow"></a>
<a name="_Toc413655744">Váldogovva</a></h2>

<p>
<img src="images/image007.png" width="538" height="415" alt="Title: infovox4 šearbmagovva. - Description: Voice Manager váldogovva." /></p> 
<p>Voice Manager váldogovva</p>

<p>Voice Managera gurut leavggas &#269;ájeha du jienaid. Listtuid organiserenvuohki lea dego muorra. Boahttevaš kapihttaliin geavahuvvo terminologiija mii lea dego muorravuogádat, gos &#269;ilgejuvvojit &#269;uoggát mat leat gurut bealde leavggas: </p> 
<p>Tearbma&#269;uokkis &#269;ilge &#269;uoggá muorravuogádaga ollisvuo&#273;as, sátni oaksi &#269;ilge oavssi vuolit muoras. Sáhtát deaddilit “oažžu” – dahje “láhpe”- &#269;uoggái &#269;ájehan dihte buot ovssiid ja lasttaid &#269;uoggá vuolde. </p> 
<p>Go deaddilat jietnanama jietnalisttus de &#269;ájehuvvo bajimusas olgeš bealde diehtu mii gullá jitnii.</p> 
<p>Olgeš bealde vuolit oasis lea teakstaboksa masa sáhtát &#269;állit teavstta ja &#269;uojahit dan válljejuvvon jienain. Dát bargu lea erenomáš geavatlaš go bijat paramehtáriid iežas jienaide. Sáhtát bidjat paramehtáriid ja iskat mo dát váikkuhit jitnii. Divo paramehtára fas, ja iskka go deaddilat &#268;uojat boalu. Sáhtát maiddái geavahit &#269;uojat boalu fiilafállosis dahje <strong>F2-</strong>boaluin. Dan botta go teaksta &#269;uojahuvvo, de sáhtát deaddilit <strong>F2 </strong>bissehan dihte &#269;uojaheami.</p> 
<p>Vuolimusas Voice Manager váldogovas gávnnat njeallje boalu ja bovssa. Daid doaimmat leat ná:</p>

<table> 
<tbody>
<tr> 
<td> 
<p>
<a name="d0e1260"> '+' boallu</a></p> </td> 
<td> 
<p>Go dán deaddilat de ráhkaduvvo o&#273;&#273;a jietna álgoálgosaš jiena vuo&#273;ul. Boalu ii sáhte deaddilit jos ii leat válljejuvvon jietna jietnalisttus. Seammá barggu bijat johtui jos geavahat kommándo O&#273;&#273;a iežas heivehuvvon jietna Fiila fállosis. </p> </td> </tr> 
<tr> 
<td> 
<p>'-' boallu</p> </td> 
<td> 
<p>Go dán deaddilat de váldá eret jiena maid leat válljen jietnalisttus. Dušše jienat maid geavaheaddji ieš lea ráhkadan sáhttá sihkkut. Boalu ii sáhte deaddilit jos ii leat válljejuvvon jietna jietnalisttus, dahje jos válljejuvvon jietna lea álgoálgosaš jietna. Seammá barggu sáhtát dahkat jos bijat johtui Sihko iešheivehuvvon jienat fiila fállosis. </p> </td> </tr> 
<tr> 
<td> 
<p>Sortere giela bokte</p> </td> 
<td> 
<p>Jienat leat standárdan sorterejuvvon alfabehtala&#269;&#269;at namaid mielde. Muhtumin lea buoret sorteret jienaid giela bokte. Dát lea boa&#273;us jos dán heivehusa válljet. </p> </td> </tr> 
<tr> 
<td> 
<p>Sihkkarastinmá&#331;gosamáhcaheami boallu</p> </td> 
<td> 
<p>Deaddil dán jos háliidat máhcahit jiena maid leat ovdal ráhkadan. Dát mearkkaša ahte buot heivehusaid maid leat dahkan sihkkojuvvojit ja paramehtáriid standárda heivehusat bohte dan sadjái. Sáhtát maiddái dahkat dán Fiila fállosa bokte go deaddilat Sihkkarastinmá&#331;gosamáhcaheapmi. </p> </td> </tr> 
<tr> 
<td> 
<p><em>Vurke</em> boallu</p> </td> 
<td> 
<p>Go deaddilat dán de vurke jietnaparamehtáriid heivehusaid. Don sáhtát maid geavahit kommándo Vurke iešheivehuvvon jienat Fiila fállosis. </p> </td> </tr> </tbody></table> 
<p>Iešvuo&#273;aboksa &#269;ájehuvvo gasku olgeš bealde jos iežas heivehuvvon jietna válljejuvvo jietnalisttus. Dát lea juohkásan njealji oassái gos sáhttá heivehit buot jiena iešvuo&#273;aid. Jienaid iešvuo&#273;aid birra gávnnat eanet die&#273;uid 
<a href="#VoiceProperties">Jietnaiešvuo&#273;at</a> oasis. </p> 
<h2>
<a name="Tutorials"></a>
<a name="_Toc413655745">Oahpahus</a></h2> 
<p>Jos &#269;uovut dán oahpahusa de oahpat mo barggat dábáleamos doaimmaid, dego ráhkadit, heivehit ja sihkkut heivehuvvon jiena.</p> 
<p>Oahpahusas geavahat dajaldaga <em>iežas heivehuvvon jietna</em>, go &#269;ilget jiena maid ieš leat ráhkadan/heivehan dahje sihkkon, ja go &#269;ujuhat infovox4 jiena, maid geavahat <em>álgoálgosaš jitnii </em>álggahat o&#273;&#273;a jiena.</p> 
<h3>
<a name="CreatingaVoice"></a>
<a name="_Ref413313268"></a>
<a name="_Creating_a_Voice"></a>Ráhkadit jiena</h3> 
<p>Dán ovdamearkkas ráhkadat o&#273;&#273;a jiena maid goh&#269;odat Maggie, mii vuolgá amerihká ea&#331;galasgiela jienas man namma lea Heather. Dán proseassa sáhttá dahkat buot infovox4 jienaide.</p> 
<p>Maggies lea fiidnásat nuohtta, ja hállá jo&#273;áneabbo, muhto leat guhkit bottut</p> 
<p>Bargga ná:</p> 
<p>
<a name="d0e1371"></a>
<a name="d0e1372">1. Álggat Voice Managera.</a></p> 
<p>
<a name="d0e1375">2. Geah&#269;a High Quality jienaid oavssi, raba jis dárbbašat. Buot sajáiduvvon jienat lea listtus. </a></p> 
<p>
<a name="d0e1381">3. Deaddil jiena nama maid áiggot geavahit vuo&#273;&#273;un o&#273;&#273;a jitnii. Dán ovdamearkkas geavahat Heather22k.</a></p> 
<p>
<a name="d0e1384">4. Vállje O&#273;&#273;a iešheivehuvvon jienat Fiillaid fállosis. O&#273;&#273;a iešheivehuvvon jienaid gulahallanboksa ihtá. </a></p> 
<p>
<a name="d0e1396">5. Bija nama o&#273;&#273;a jitnii O&#273;&#273;a jiena namma jietnaboksii. Dán ovdamearkkas geavahat nama “Maggie”. Ma&#331;&#331;á go leat &#269;állán nama deaddil Ráhkat o&#273;&#273;a jiena.</a>
<br /> Dál sáhtát bidjat heivehusaid o&#273;&#273;a jitnii.</p> 
<p>
<a name="d0e1407">6. Vállje Oppalaš gilkora ja bija Meari. Dán ovdamearkkas, vállje 120. </a></p> 
<p>
<a name="d0e1419">7. Vállje Gaskkalduhte gilkora ja &#269;uoggá dási Guhki..</a></p> 
<p>
<a name="d0e1431">8. Vállje Jietnadássejeaddji gilkora, aktivere Geavat filtara, ja bija jietnadássejeaddji &#269;uovvovaš dásiide (gurut bealde olgeš beallái) : <em>-1.0, -2.0, +2.0, +4.0</em>.</a></p> 
<p>
<a name="d0e1443">9. Vurke jiena, deaddil Vurke boalu, dahje vállje Vurke iešheivehuvvon jienat Fiila fállosis.</a></p> 
<p><em>Maggie</em> lea dál vurkejuvvon ja lea listtus Heather22k vuolábealde, jietna lea gárvvis geavahuvvot infovox4 prográmmain.</p> 
<h3>
<a name="Deletingavoice">Sihkkut jiena</a></h3> 
<p>Don sáhtát sihkkut jienaid Voice Manageris, muhto ii leat vejolaš sihkkut álgoálgosaš jienaid mat &#269;uvvot infovox4. </p> 
<p>Jos ovdamearkka dihte háliidat sihkkut jiena <em>Maggie</em>, maid leat aiddo ráhkadan ovddit oasis, geah&#269;a oasi 
<a href="#CreatingaVoice">Ráhkadit jiena</a>.</p> 
<p>Daga ná:</p> 
<p>
<a name="d0e1481"></a>
<a name="d0e1482">1. Álggat Voice Manager.</a></p> 
<p>
<a name="d0e1485">2. Oza ja vállje jiena maid áiggu sihkkut. Dán ovdamearkkas, vállje Maggie, mii gávdno<em> High Quality voices/Heather22k </em> vuolde.</a></p> 
<p>
<a name="d0e1494">3. Vállje Sihko iešheivehuvvon jienaid Fiila fállosis.</a>
<br /> Gulahallanboksa rahpasa ja dáhttu du duo&#273;aštit ahte áiggot sihkut jiena. </p> 
<p>
<a name="d0e1505">4. Deaddil Juo joatkin dihte proseassa.</a></p> 
<p>Jietna jávká vajot jietnalisttus. </p> 
<h3>
<a name="Editingavoice">Redigeret jiena</a></h3> 
<p>Buot iešheivehuvvon jienaid sáhttá redigeret. Nu ahte, jos mii mearridat ahte Maggie jietna, maid mii leat ráhkadan (geah&#269;a 
<a href="#CreatingaVoice">Ráhkadit jiena</a> oasi), mearri lea ain vuollin, de sáhttit rievdadit jiena eatge dárbbaš o&#273;&#273;a jiena ráhkadit.</p> 
<p>Daga ná:</p> 
<p>
<a name="d0e1529"></a>
<a name="d0e1530">1. Álggat Voice Manager.</a></p> 
<p>
<a name="d0e1533">2. Oza ja vállje jiena maid áiggut redigeret. Min ovdamearkkas válljet Maggie, maid gávnnat <em>High Quality Voices/Heather22k</em> vuolde.</a></p> 
<p>
<a name="d0e1542">3. Raba Oppalaš gilkora ja bija Meari dasa masa háliidat. Don sáhtát guldalit teavstta o&#273;&#273;a heivehusain, go &#269;álát vuolimužžii redigeren bovssas. Bija o&#273;&#273;a heivehusaid.</a></p> 
<p>
<a name="d0e1551">4. Geavat kommándo Gá&#273;a jos háliidat heivehusaid mat ledje ma&#331;imuš vurkemis, jos it leat duhtavaš heivehusain maid leat dahkan.</a></p> 
<p>
<a name="d0e1557">5. Go leat duhtavaš o&#273;&#273;a heivehusain de vurke,Vurke kommándon.</a></p> 
<h2>
<a name="VoiceProperties"></a>
<a name="_Toc413655746"></a>
<a name="_Ref413313109">Jietnaiešvuo&#273;at</a></h2> 
<p>Ii leat vejolaš rievdadit álgoálgosaš jienaid mat &#269;uvvot infovox4. Don sáhtát dušše rievdadit paramehtáriid iešheivehuvvon jienaide, geah&#269;a eanet die&#273;uid 
<a href="#CreatingaVoice">Ráhkadit jiena</a> oasis. Go leat ráhkadan jiena, de lea dat justa seammá go jietna maid geavahit o&#273;&#273;a jiena vuo&#273;&#273;un. Go áiggot bidjat jietnaparamehtáriid, de válljet jietnanama jietnalisttus gurut bealde. Jietnaiešvuo&#273;aid gulahallanšlájat &#269;ájehuvvojit olgeš ruvttos. Dál sáhtát rievdadit jiena iešvuo&#273;aid, ovdamearkka dihtii hállanleavttu, frekveansaválljema, jnv. Don sáhtát geah&#269;&#269;aladdat jiena nu ahte heive du geavahussii. </p>

<table> 
<tbody>
<tr> 
<td> 
<p>
<a name="d0e1577">
<img src="images/image008.jpg" width="24" height="24" /></a></p> </td> 
<td> 
<p>Mearkkaš: Buot paramehtárat eai leat olámuttos buot jienaide. Jos muhtin spesifiserejuvvon paramehtár ii leat olámuttos, de ii leat dát válljejuvvon jienas. Ovdamearkka dihtii ii beasa geavahit paramehtára nuohttaallodaga <em>High Quality (HQ)</em> jienain.</p> </td> </tr> </tbody></table> 
<p>Don sáhtát maiddái rahpat Iešvuo&#273;aid go deaddilat dáid, geavat olgeš/gurut njuola, dahje Iežas heivehuvvon fállosis. Sáhttá maid geavahit boallobeavddi jo&#273;ánisboaluid:</p> 
<p><strong>CTRL + F1</strong> rahpá <em>Oppalaš </em>šlája</p> 
<p><strong>CTRL + F2</strong> rahpá <em>Gaskkalduhte</em> šlája</p> 
<p><strong>CTRL + F3</strong> rahpá <em>Lohkamin</em> šlája</p> 
<p><strong>CTRL + F4</strong> rahpá <em>Jietnadássejeaddji </em> šlája</p> 
<p><strong>CTRL + F5</strong> rahpá <em>Teakstagie&#273;ahallan </em>šlája</p> 
<p>Jietnaiešvuo&#273;aid boksa lea sirrejuvvon njealji fanaide:</p>

<table> 
<tbody>
<tr> 
<td> 
<p>
<a name="d0e1643">Oppalaš</a></p> </td> 
<td> 
<p>Sisttisdoallá jietnameari ja jietnadási válljejumiid.</p> </td> </tr> 
<tr> 
<td> 
<p>Gaskkalduhte</p> </td> 
<td> 
<p>Diktá rievdadit gaskkalduhttimiid mat leat dán šlájas. Sáhtát válljet vaikke gu&#273;e árvvu mii lea listtus. Sáhtát maiddái dohkkehit standárdaárvvu mii boahtá ma&#331;&#331;á teakstagie&#273;ahallama teakstasisdoalu vuo&#273;ul. </p> </td> </tr> 
<tr> 
<td> 
<p>Lohkamin</p> </td> 
<td> 
<p><em>Lohkamin </em>spesifisere mo teaksta lohko. Standárdaárvu lea dábálaš, mii mearkkaša dábálaš lohkan. Válljejumit mat báhcet, lea lohkat ovtta ja ovtta sáni, dahje stávet ovtta ja ovtta bustávva. Go lea sáhka stávemis ja sániid lohkamis, de sáhttá maid rievdadit bottubistima teakstaovttadagaid gaskka. </p> 
<p>Mearkkaš: Gaskkalduhttimiid áiggiid válljen ii guoská buot infovox4 jienaide.</p> </td> </tr> 
<tr> 
<td> 
<p>Jietnadássejeaddji</p> </td> 
<td> 
<p>Jietnadássejeaddji diktá du rievdadit akusttalaš beavttuid jienas, go rievdadat njeallje iešgu&#273;et lágan frekveansabáttiid.</p> 
<p>Go válljet Jietnadássejeaddji-kategoriija, de ii leat dábála&#269;&#269;at jietnadássejeaddji válljejuvvon, ja botkkon ii leat alde. Deaddil Geavat silli bidjat jietnadássejeaddji ala. Dál sáhtát botkkona rievdadit mo jietna galgá gullot. Juohke botkkon heive spesifiserejuvvon frekveansábaddái, alla gitta vuollegaš frekveanssaide. </p> 
<p>Jietnadássejeaddjis lea njeallje ovdagihtii válljejumi: bássaalideapmi, bássavuolideapmi, diskántaalideapmi ja diskántavuolideapmi. Don sáhtát geavahit dáid go redigeret jienaid.</p> 
<p>Sáhtát maid defineret ieš ovdagihtii jietnadássejeaddji válljejumiid maid sáhttá geavahit buot jienaide. Jos dán áiggut dahkat de sirdde botkkona dan jietnadássejeaddji válljemiid maid áiggut geavahit. Mana kombinašuvdnaboksii ja &#269;ále nama ovdagihtii válljejupmái. Deaddil de <em>Lasit </em>boalu. Jos deaddilat <em>Sihko </em>de sihkku jietnadássejeaddji ovdagihtii válljejumi. </p> 
<p>Ovdagihtii válljejumi sáhtát dál gávdnat <em>Equ</em>-mearkkain. Geah&#269;a 
<a href="#TextTags">Teakstamearkkat</a> eanet die&#273;uid dás.</p>
<p> </p></td> </tr> 
<tr> 
<td> 
<p>Teakstagie&#273;ahallan</p> </td> 
<td> 
<p>Teavsttas-hállamii vuogádat sáhttá gie&#273;ahallat teavstta guovtti vuogi mielde. Ovdáneaddji meannudeapmi lea standárdaválljejupmi. Dát mearkkaša ahte teaksta analyserejuvvo ja dulkojuvvo. Nummáriid ja oanádusaid jietnadeapmi &#269;atnosa ovdamearkka dihtii kontekstii. Teakstameannudeami bietnat gávnnat gielaid giellagiehtagirjjis. Muhtimin sáhttá leat nu ahte dán háliida jáddadit. Dalle válddát eret mearkka Hállás modus bovssas. </p> 
<p>Eará maid sáhtát válljet dán kategoriijas, gusto dušše arábalaš jienaide. Dás sáhtát válljet mo teaksta mii ii leat arábagillii galgá dulkot, ja makkár jietna galgá lohkat teavstta mii ii leat arábagillii. Sáhtát válljet guokte giela: Ea&#331;galasgiela ja fránskkagiela. Goappašiid gielaide sáhtát válljet jienaid mat leat dáin gielain. Standárdaválljen lea <em>Ii oktage, </em>mii mearkkaša ahte teaksta mii ii leat arábagillii lohko arábalašjienain. </p> 
<p>Ferte álggahit Voice Manager o&#273;&#273;asit ovdalgo rievdadusat váldojit geavahussii. Deaddil boalu Álggat o&#273;&#273;asit dahkat dán. De sáhtát geah&#269;&#269;alit mo o&#273;&#273;a válljejumit doibmet.</p>
<p> </p></td> </tr> </tbody></table> 
<h2>
<a name="VMMenusandFunctions"></a>
<a name="_Toc413655747">Válljenvejolašvuo&#273;at ja doaimmat</a></h2> 
<h3>
<a name="VMTheFilemenu">Fiillaid fálus</a></h3>

<table> 
<tbody>
<tr> 
<td> 
<p>
<a name="d0e1775"><strong>O&#273;&#273;a iežas heivehuvvon jietna, CTRL + N</strong></a></p> </td> 
<td> 
<p>Dát kommándo ráhkada o&#273;&#273;a jiena álgoálgosaš jienas. Vállje álgoálgosaš jiena jietnalisttus ja bija barggu johtui. Dát rahpá o&#273;&#273;a gulahallanbovssa gosa fertet &#269;állit o&#273;&#273;a jiena nama. Deaddil <em>Ráhkat</em> dahje <em>Enter. </em> O&#273;&#273;a jietna biddjo de listui álgoálgosaš jiena vuollái </p> </td> </tr> 
<tr> 
<td> 
<p><strong>Molsso nama iešheivehuvvon jienat,
<br /> CTRL + R</strong></p> </td> 
<td> 
<p>Don bijat nama o&#273;&#273;a jitnii go ráhkadat dan, muhto lea maid vejolaš bidjat molsut nama ma&#331;&#331;á. Jos áiggut dahkat dán, de vállje iešheivehuvvon jienat. Geavat kommándo fiila fállosis. &#268;ále o&#273;&#273;a nama ja deaddil <em>Enter</em>.</p> </td> </tr> 
<tr> 
<td> 
<p><strong>Máhcat standárdii</strong></p> </td> 
<td> 
<p>Dát kommándo máhcaha iešheivehuvvon jienaid standárda válljejumiide. Boa&#273;usin lea ahte heivehuvvon jietna šaddá seammá go álgoálgosaš jietna. </p> </td> </tr> 
<tr> 
<td> 
<p><strong>Guldal die&#273;uid</strong></p> </td> 
<td> 
<p>Dát &#269;uojaha válljejuvvon jiena die&#273;uid. Dán die&#273;u gávnnat bajimusas olgeš bealde váldogovas.</p> </td> </tr> 
<tr> 
<td> 
<p><strong>&#268;uojat, F2</strong></p> </td> 
<td> 
<p>Geavat dán kommándo &#269;uojahit teavstta. Go teaksta lohkkojuvvo, de ihtá kommándo Bisset, dan sáhttá geavahit jos áigu bissehit lohkama.</p> </td> </tr> 
<tr> 
<td> 
<p><strong>Heaittit, CTRL + Q</strong></p> </td> 
<td> 
<p>Dát kommándo heaittiha Voice Manager prográmma.</p> </td> </tr> </tbody></table> 
<h3>
<a name="VMCustomizeMenu">Iežas heivehan fálus</a></h3> 
<p>Dán fállosa sáhttá dušše geavahit iešheivehuvvon jienaide. Bargguid maid sáhtát dahkat dán fállos bokte lea seammá maid sáhtát dahkat Iešvuo&#273;aid leavgga bokte, Geavat dan mii heive dutnje buoremusat. </p> 
<p>Fálus válljemat ja vuolitfálus leat seammá go paramehtárat maid sáhtát válljet jitnii. Jos válljejuvvo álgoálgosaš jietna jietnalisttut, de dát falus ii leat aktiivva.</p>

<table> 
<tbody>
<tr> 
<td> 
<p>
<a name="d0e1886"><strong>Oppalaš</strong></a></p> </td> 
<td> 
<p>Dás leat njeallje vuolit fállosa olámuttus: <em>Mearri</em>, <em>Jietnadássi</em>, <em>Hábmen</em>, ja<em> Nuohttaallodat</em>. Jos dáin ovttage válljet de sirdá du <em>Oppalaš</em> kategoriijai ja fokus biddjo botkkonii. Geavat gurut ja olgeš njuolaid lonuhit árvvu. </p> </td> </tr> 
<tr> 
<td> 
<p><strong>Gaskkalduhtte</strong></p> </td> 
<td> 
<p>Geavat dán go válljet bottu guhkkodaga. Vuosttaš vuolitfállosis válljet gaskkalduhttintiippa. Leat njeallje gaskkalduhttintiippa: <em>Cealkkaloahpaheapmi, Earromearkkat, Bealle&#269;uokkis ja Ruo&#273;ut. </em>Nuppi vuolitfállosis válljet árvvu. Gávdnojit dát árvvut: <em>Standárda</em> (teavsttas-hállamii válljejuvvo automáhtala&#269;&#269;at), <em>Hui oanehis</em>, <em>Oanehis</em>, <em>Gaskageardán</em>, <em>Guhkki</em> ja <em>Hui guhkki.</em></p> </td> </tr> 
<tr> 
<td> 
<p><strong>Lohkamin</strong></p> </td> 
<td> 
<p>Dát diktá du válljet lohkanmodusa. Vuosttaš vuolitfállosis válljet gaskal golmma lohkanmodusa: <em>Dábálaš</em> (dábálaš lohkan), <em>Sánis sátnái</em> ja <em>Stáven. </em> Geavat <em>Gaskkalduhte </em>kategoriija go áiggut bidjat gaskkalduhttimiid guhkkodaga lohkamiid ovttadagaid gaskka. Dát guoská dušše <em>Sánis sátnái </em>ja <em>Stávema </em>vuo&#273;&#273;omihtuide. Gávdnojit dát árvvut: <em>Standárda</em> (teavsttas-hállamii válljejuvvo automáhtala&#269;&#269;at), <em>Hui oanehis</em>, <em>Oanehis</em>, <em>Gaskageardán</em>, <em>Guhkki</em> ja <em>Hui guhkki</em></p> </td> </tr> 
<tr> 
<td> 
<p><strong>Jietnadássejeaddji</strong></p> </td> 
<td> 
<p>Aktivere Jietnadássejeaddji go deaddilat <em>Alde</em>. Deaddil <em>Eret</em> go loahpahat dán. </p> 
<p>Kommándo <em>Doaimmat</em> jietnadássejeaddji sáhttá geavahit go lea <em>alde</em>,mu&#273;ui ii sáhte válljet dán kommándo. Go válljet <em>Doaimmat </em>de rahpá <em>Jietnadássejeaddji </em>kategoriija mas lea fokus dan vuosttas jietnadássejeaddji botkosis. Geavat vulos ja bajás njuolaid válljet árvvu. Go válljet kategoriija de rievdá fokus nuppi jietnadássejeaddji botkkonii.</p>
<p> </p></td> </tr> 
<tr> 
<td> 
<p><strong>Teaksta meannudeapmi</strong></p> </td> 
<td> 
<p>Dás sáhtát válljet válljejumiid mat váikkuhit teaksta meannudeapmái. </p> 
<p>Jos válljet kommándo <em>Hállás modusa </em>de boahtá sisa infovox4 komponeanta mii meannuda oanádusaid ja nummariid. Jos dát modus ii leat geavahusas, de lohko teaksta nu mo lea, iige dulko konteavstta. <em>Hállás modus </em>lea standárdan aktiverejuvvon. </p> 
<p>Kommándo <em>Giellaáican </em>guoská dušše arábajienaide. Válljet jiena ja giela mii galgá geavahuvvot ovttas arábajienain, go lohká teavstta mii ii leat arábagillii. </p> 
<p>Voice Manager ferte o&#273;&#273;asit álggahuvvot, vai teakstameannudeami válljejumit doibmet. Geavat kommándo <em>Álggat o&#273;&#273;asit.</em></p>
<p> </p></td> </tr> </tbody></table> 
<h3>
<a name="VMHelp">Veahkki</a></h3>

<table> 
<tbody>
<tr> 
<td> 
<p>
<a name="d0e2081"><strong> Sisdoallu F1</strong></a></p> </td> 
<td> 
<p>Rahpá infovox4 Veahkki</p> </td> </tr> 
<tr> 
<td> 
<p><strong>Voice Manager birra</strong></p> </td> 
<td> 
<p>Dát kommándo rahpá bovssa gos leat die&#273;ut dán veršuvnna Voice Manager birra. </p> </td> </tr> </tbody></table> 
<br /> 
<h1>
<a name="PronunciationEditor"></a>
<a name="_Toc413655748"></a>
<a name="_Ref413316026"></a>
<a name="_Ref413312876"></a>
<a name="_Ref413309061"></a>
<a name="_Pronunciation_Editor"></a>Pronunciation Editor</h1> 
<p>Sáhtát geavahit geavaheaddjileksikona jos áiggut rievdadit jiena standárdajietnadeami. Dát dahkko dábála&#269;&#269;at jos áiggut oažžut rievttes jietnadeami akronymaiguin, maid teakstameannudanprográmma ii dovdda, dahje divvut ja rievdadit muhtin sániid jietnadeami, ovdamearkka dihtii vierissániid. </p>

<p>
<a name="d0e2139">
<img src="images/image009.png" width="538" height="249" alt="Title: infovox4 šearbmagovva. - Description: Pronunciation Editor govva." /></a></p> 
<p>Pronunciation Editor govva</p>

<h2>
<a name="HowtousethePronunciationEditor"></a>
<a name="_Toc413655749">Ná geavahit Pronunciation Editor</a></h2> 
<h3>
<a name="Lexiconsofpronunciations">Jietnadeami Leksikona</a></h3> 
<p>Leksikona mii ráhkaduvvo Pronunciation Editors gullá vissis gillii. Ovdamearkka dihtii, leksikona mii lea ráhkaduvvon Amerihká ea&#331;galasgillii doaibmá Amerihká ea&#331;galasgiela jienaiguin, iige váikkut Britannia ea&#331;galasjienaide, mii gáibida iežas jietnadeami leksikona. </p> 
<p>Váldogovas sáhtát válljet leksikona maid áiggut geavahit, vállje jietnajoavkku Jietnajoavkkulisttus. </p> 
<h3>
<a name="Addinganewlexiconentry">Lasihit o&#273;&#273;a leksikonsáni</a></h3> 
<p>Jos háliidat rievdadit jietnadeami sánis seammá gielas, de fertet lasihit rievttes sáni jietnadanleksikonii. Álggos iskat ahte giella mainna áiggut bargat lea jietnajoavkkus, deaddil de boalu <em>Lasit sáni</em>. Sáhtát maiddái geavahit fállosa <em>Leksikona&#8594;Lasit sáni, </em>dahje jo&#273;ánisvuogi <strong>Ctrl+A</strong>.</p> 
<p>&#268;ále <em>Álgoálgosaš sáni </em>sadjái sáni mas áiggut rievdadit jietnadeami. Sátni &#269;ájehuvvo automáhtala&#269;&#269;at fonehtalaš transkripšuvnnain Fonehtalaš Transkripšuvnna sajis, jos dát lea rabas. Fonehtalaš transkripšuvdna ii lea standárdan, muhto sáhtát rahpat dán go deaddilat boalu gurut bealde <em>Álgoálgosaš sáni</em> ja <em>O&#273;&#273;a jietnadeami</em> sajis. Sáhtát maiddái geavahit kommándo <em> &#268;ájet&#8594;&#268;ájet fonehtalaš transkripšuvnnaid</em> dahje jo&#273;ánisboaluid <strong>Ctrl+T.</strong></p> 
<p>&#268;ále o&#273;&#273;a jietnadeami <em>O&#273;&#273;a jietnadeami</em> sadjái. O&#273;&#273;a jietnadeapmi &#269;ájehuvvo automáhtala&#269;&#269;at Fonehtala&#269;&#269;at transkripšuvnna sajis. </p> 
<p>Sáhtát spesifiseret jietnadeami guovtti láhkai. Vuosttaš vuogi mielde geavahat fonehtalaš mearkkaid, ja nuppi vuogi mielde lea go &#269;álát sáni dábálaš teakstan. </p> 
<p>Jos geavahat fonehtalaš mearkkaid jietnadeamis de fertet álggahit <em>“#'” </em>mearkkain. Mu&#273;ui dulko jietnadeami dábálaš teakstan. Jos almmuhat jietnadeami dábálaš teakstan (it geavat fonehtalaš mearkkaid), de sáhtát geavahit ortografiija, boasttustávema dahje rievdadit &#269;állinvuogi. Dát goh&#269;oduvvojit rievdadit &#269;állinvuogi. </p> 
<p>Ii rávvejuvvo geavahit gaskka dahje teakstamearkkaid go rievdadit &#269;állinvuogi. Jos bijat jietnadeapmái eambbo go ovtta sáni, de rávvejuvvo ahte don vurket sáni fonehtala&#269;&#269;at. Dát buorida jietnadankvalitehta. Fonehtalaš transkripšuvnna vurken lea standárdaválljen. Dát mearkkaša dan ahte jos &#269;álát jietnadeami dábálaš teakstan (ahte it geavat fonehtalaš mearkkaid), de jietnadeapmi konverterejuvvo fonehtalaš strea&#331;gan ja vurkejuvvo leksikonii. Jos vurket jietnadeami dego rievdaduvvon &#269;állinvuohku (ahte it geavat fonehtalaš mearkkaid), de váldde eret mearkka <em>Transkribere fonehtala&#269;&#269;at</em> sajis. Jos dán mearkka válddat eret,de vurkejuvvo &#269;állinvuohki nie mo leat &#269;állán <em>O&#273;&#273;a jietnadeami</em> bovssas. </p> 
<p>Deaddil <em>O&#273;asmahte</em> vai vurke rievdadusaid. </p> 
<p>Loga oasi 
<a href="#Finetuningthenewpronunciation">Dárkilastit o&#273;&#273;a jietnadeami</a> rievdadus eanet die&#273;uid fonehtalaš transkripšuvnnaid birra. </p> 
<h3>
<a name="Updateanexistingentry">O&#273;asmahttit sáni mii gávdno ovddežis</a></h3> 
<p>Jos háliidat o&#273;asmahttit sáni mii ovddežis gávdno jietnadan leksikonas, de válljet sáni leksikonas. </p> 
<p>Álgoálgosaš sátni ja dán fonehtalaš transkripšuvdna &#269;ájehuvvo <em>Álgoálgosaš sáni</em> ja dán <em>Fonehtalaš transkripšuvnna</em> sajis. Dálá jietnadeami &#269;ájehuvvo <em>O&#273;&#273;a jietnadeami</em> sajis. Jos dálá jietnadeapmi lea spesifiserejuvvon dábálaš teakstan, de &#269;ájehuvvo maiddái jietnadeami fonehtalaš transkripšuvdna <em>Fonehtalaš transkripšuvnna</em> sajis. </p> 
<p>Jos jietnadeami lea fonehtalaš transkripšuvdnan, de geavat dán ovddabeallái <em>"#"</em> mearkka.</p> 
<p>
<a name="Listeningtotheoriginalwordandthenewpron">Deaddil <em>O&#273;asmahte</em> vai vurke rievdadusaid. </a></p> 
<h3>Guldalit álgoálgosaš sáni ja o&#273;&#273;a jietnadeami</h3> 
<p>Lea vejolaš guldalit álgoálgosaš jietnadeami go deaddilat<em> &#268;uojat</em> olgeš bealde <em>Álgoálgosaš</em> sátni. Sáhtát maiddái fálus bokte dáhkat dán <em>Leksikona &#8594; &#268;uojat álgoálgosaš sáni </em>dahje jos deaddilat &#269;állinbeavddis <strong>F2</strong>.</p> 
<p>Sáhtát maiddái guldalit mo o&#273;&#273;a transkripšuvdna gullo, maid leat &#269;állán <em>O&#273;&#273;a jietnadeami</em> sadjái go deaddilat<em> &#268;uojat</em> boalu olgešbealde. Sáhtát maid geavahit kommándo <em>Leksikona &#8594; &#268;uojat o&#273;&#273;a jietnadeami </em>dahje deaddilat &#269;állinbeavddis <strong>Alt+F2</strong>.</p> 
<h3>
<a name="Deletinganentry">Sihkkut sáni</a></h3> 
<p>Vállje leksikonas sáni maid áiggut sihkkut. Dán dagat dán fállos bokte <em>Leksikona &#8594; Sihko sáni. </em>Sáhtát maiddái geavahit <em>Sihko sáni </em>boalu dahje &#269;állinbeavddis <strong>Ctrl+D</strong>. Sáhtát maid deaddilit &#269;állinbeavddis <em>delete </em>dahje <em>backspace</em>. </p> 
<h3>
<a name="Savingthelexicon">Vurket leksikona</a></h3> 
<p>Rievdadusaid maid dagat Pronunciation Editors, eai doaimma prográmmain ovdalgo leat vurken rievdadusaid. Go áiggut vurket rievdadusaid, de mana <em>Fiillat </em>fállosa bokte <em>Fiillat &#8594; Vurke </em> dahje &#269;állinbeavddi bokte <strong>Ctrl+S</strong>.</p> 
<h3>
<a name="Usingupdatedpronunciationlexiconwithinf">Geavahit o&#273;asmahtton jietnadan leksikona infovox4 jienain</a></h3> 
<p>Go leat vurken jietnadan leksikona, de sáhtát geavahit dáid ovttas infovox4 jienaid buot <em>Microsoft Speech API</em> prográmmain. Jos du jienat leat áidobeale leamaš geavahusas, de fertet o&#273;&#273;asit bidjat prográmma johtui ma&#331;&#331;á go leat vurken leksikona.</p> 
<p>Ovdamearkka dihte jos rabat prográmma mii geavaha infovox4 US Ea&#331;galasjiena Heather ja leat de dahkan rievdadusaid jietnadeamis, de dát rievdadusat eai váikkut Heathera jietnadeami, vaikke leat vurken leksikona. Jos Heather galgá geavahit leksikona, de fertet jáddadit ja o&#273;&#273;asit bidjat johtui prográmma. Heathera ferte o&#273;&#273;asit bidjat johtui. </p> 
<h3>
<a name="Changingtheworkingvoice">Rievdadit jiena mii lea bargamin</a></h3> 
<p>Go leat bargamin ovtta gielain, de Pronunciation Editor geavaha vuosttaš jiena jietnajoavkkus standárda &#269;uojahan jietnan. Jos jietnajoavkkus leat má&#331;ga jiena, de sáhtát rievdadit jiena mii galgá lohkat sániid ja sániid transkripšuvnnaid. Vállje <em>Leksikona&#8594;Jienat.</em></p> 
<p>Boahtte háve go rabat jietnajoavkku leksikona, de geavahuvvo ma&#331;imuš válljejuvvon jietna standárda jietnan.</p> 
<h2>
<a name="Finetuningthenewpronunciation"></a>
<a name="_Toc413655750"></a>
<a name="_Ref413315603">Dárkilastit o&#273;&#273;a jietnadeami</a> </h2> 
<p>Dán oasis &#269;ilgejuvvo man láhkai bargat beaktilit fonehtalaš transkripšuvnnain, lingvisttalaš máhttu haga. </p> 
<p>Fonehtalaš alfabehta &#269;ilgehus mearriduvvon gillii, gávdno giellagiehtagirjjis (dát gávdno infovox4 USB &#269;oavdaga dokumeantamáhpas). Sáhtát oaidnit fonehtalaš mearkkaid go deaddilat boalu <em>&#268;ájet fonemalisttu &#268;ájet </em>fállosis. &#268;állinbeavddi jo&#273;ánisboalut leat dán kommándoi <strong>Ctrl+P.</strong></p> 
<p>Muitte bidjat mearkka <strong># </strong>fonehtalaš transkripšuvnna ovddabeallái maid &#269;álát <em>O&#273;&#273;a jietnadeami </em>sadjái. </p> 
<p>Ovdamearka: <em>Reading</em> lea Englándda gávpot namma, ja das áiggut rievdadit jietnadeami amerihká ea&#331;galasjitnii. Standárdajietnadeapmi dán sánis lea “reeding”, infovox4 dulko ahte ing-hápmi lea oassi “read” vearbbas. Jos &#269;álát <em>Reading </em>álgoálgosaš sáni sadjái, de &#269;ájeha amerihká ea&#331;galaš standárdajietnadeami fonehtalaš transkripšuvnna, mii lea infovox4is, "<em>#r i1 d I N</em>". Don háliidat ahte dát sátni galgá jietnaduvvot "<em>#r E1 d I N</em>", mii lea rievttes jietnadeapmi dán Englándda gávpoga namas. Sáhtát &#269;állit olles fonehtalaš transkripšuvnna "<em>#r E1 d I N</em>" O&#273;&#273;a jietnadeami sadjái, muhto jos it dovdda infovox4 fonehtalaš transkripšuvnna de sáhtát geavahit ovtta dáid vugiin: </p> 
<p>
<a name="Method1"><strong>Vuosttaš vuohki</strong></a></p> 
<p>
<a name="d0e2421"></a>
<a name="d0e2422">1. Deaddil <em>“Lohkamin” “Álgoálgosaš sáni” </em>sajis. Fonehtalaš transkripšuvdna "<em>#r i1 d I N</em>" &#269;ájehuvvo Fonehtalaš transkripšuvnna sajis jos &#269;ájehuvvo. Jos ii oidno, deaddil boalu mii lea merkejuvvon oažžunmearkan (+). Seammá bohtosa oažžut jos válljet fállokommándo <em>&#268;ájeheapmi </em></a><em>&#8594; &#268;ájet fonehtalaš transkripšuvnna </em>dahje &#269;állinbeavddis <strong>Ctrl+T</strong>.</p> 
<p>
<a name="d0e2443">2. Deaddil njuola vulos olgeš bealde Fonehtalaš transkripšuvnna sajis. Dát má&#331;ge fonehtalaš teavstta "<em>#r i1 d I N</em>"<em>Álgoálgosaš jienas O&#273;&#273;a jietnadeami </em>sadjái. Sáhtát maiddái geavahit fálus kommándo <em>Leksikona </em></a><em>&#8594; Má&#331;ge sáni transkripšuvnna </em>dahje deaddil &#269;állinbeavddis <strong>Ctr+K</strong>.)</p> 
<p>
<a name="d0e2464">3. Geah&#269;a fonehtalaš mearkkaid listtus dan fonehtalaš merkii maid áiggut &#269;állit. Raba fonehtalaš mearkkaid listtu go deaddilat <em>&#268;ájet fonema listtu.</em> Sáhtát maiddái geavahit fálus kommándo <em>&#268;ájeheapmi </em></a><em>&#8594; &#268;ájet fonema listtu </em>dahje deaddilat &#269;állinbeavddis <strong>Ctr+P</strong> .
<br /> Fonehtalaš mearkka maid dárbbašat lea /<em>E</em>/ mii gávdno sániin <em>bet</em> ja <em>recognition</em> fonematabeallas. Buhtte mearkka /<em>i</em>/ <em>O&#273;&#273;a jietnadeami</em> sadjái /<em>E</em>/.
<br /> Mearkkaš ahte mearka /<em>1</em>/ , geavahuvvo leksikálalaš aksentii, mii &#269;ilge stávvaldeattu sánis. </p> 
<p>
<a name="d0e2501">4. Deaddil O&#273;asmahte bidjat o&#273;&#273;a sáni leksikonii.</a></p> 
<p>
<a name="Method2"><strong>Nubbi vuohki</strong></a></p> 
<p>
<a name="d0e2510"></a>
<a name="d0e2511">1. Dáinna vugiin geah&#269;&#269;alat gávdnat stávvalvuogi mii geavahuvvo jietnadit sáni mainna leat bargamin. Min ovdamearkkas oažžut bohtosa maid háliidat go stávet nama <em>Redding</em>. &#268;ále sáni <em>Redding </em>O&#273;&#273;a jietnadeami sadjái. Fonehtalaš transkripšuvdna "<em># r E1 d I N</em>" &#269;ájehuvvo Fonehtalaš transkripšuvnna sajis, jos &#269;ájehuvvo. Jos ii oidno, deaddil golmma&#269;iegaga vai oidno, dahje geavat fálus kommándo &#268;ájeheapmi</a>&#8594;&#268;ájet fonehtalaš transkripšuvnna. </p> 
<p>
<a name="d0e2534">2. Deaddil njuola mii manná bajás guvlui olgeš bealde <em>Fonehtalaš transkripšuvnna </em>saji. Sáhtát maid geavahit kommándo Leksikona</a>&#8594;Má&#331;ge jietnadeami transkripšuvnna dahje &#269;állinbeavddis <strong>Ctrl+Njuolla bajás. </strong>Dát bargu má&#331;ge fonehtalaš strea&#331;gga "<em>#r E1 d I N</em>" O&#273;&#273;a jietnadeami sadjái.</p>

<p>
<a name="d0e2552">3. Deaddil O&#273;asmahte vai o&#273;&#273;a sátni boahtá leksikonii.</a></p> 
<h2>
<a name="Importingandexportingpronunciationlexic"></a>
<a name="_Toc413655751">Jietnadanleksikonaid sisa- ja olggosfievrrideapmi</a></h2> 
<h3>
<a name="Exporting"></a>
<a name="_Ref413315695">Olggosfievrrideapmi</a></h3> 
<p>Jietnadanleksikona sáhttá konverteret teakstahabmái (<em>.txt</em>) dahje vurket dan go geavahat infovox4 leksikona hámi (<em>.dic</em>). Eará sániin daddjon sáhtát olggosfievrridit leksikona. Dán dagat go geavahat kommándo <em>Fiillat&#8594; Olggosfievrrideapmi...</em>Sáhtát maid &#269;állinbeavdde bokte dahkat dán go deaddilat <strong>Ctrl+Shift+X</strong>.</p> 
<p>Vállje fiillanama ja saji gosa áiggut vurket dán, vállje maiddái fiilahámi. Standárda fiilahápmi lea <em>teaksta fiila </em>(fiilatiippa: <em>.txt</em>). sáhtát maiddái válljet <em>Acapela Leksikona fiillat </em>binára hámi (fiilatiippa: <em>".dic"</em>.). Acapela Leksikona fiila hápmi sáhttá leat ávkkálaš sihkkarastinmá&#331;gosiid olis. Ii leat vejolaš sirdit Acapela leksikona binára hámis ovtta gielas eará gillii. </p> 
<p>Deaksta hápmi lea <em>tabuláhtorjuhkkojuvvon</em>, dát mearkkaša ahte dus lea okta sátni juohke linjas, ja ahte álgoálgosaš sátni ja <em>o&#273;&#273;a transkripšuvdna</em> juhkkojuvvo tabuláhtormearkkain. </p> 
<h3>
<a name="Importing"></a>
<a name="_Ref413315817">Sisafievrrideapmi</a></h3> 
<p>Jos beasat leksikonii mii lea I<em>".dic"</em> fiila, ahte lea Acapela binára hámis, de sáhtát lasihit dan infovox4 leksikonii. Sáhtát maiddái lasihit leksikona sániid ovtta teakstafiillas jos teakstafiila lea hábmejuvvon nu go hápmi lea &#269;ilgejuvvon 
<a href="#Exporting">Olggosfievrrideapmi</a> &#269;állosis. Dát bargu goh&#269;oduvvo <em>fiillaid sisafievrrideapmi.</em></p> 
<p>Mearkkaš ahte fiila maid sisafievrridat das fertejit leat sánit dan gielas mii lea aktiiva Pronunciation Editors go álggahat barggu. </p> 
<p>Sáhtát sisafievrridit leksikonaid sániid mat lea gustovaš leksikonas go geavahat fálus kommándo <em>Fiillat &#8594; Sisafievrrit ...</em>. Sáhtát maid álggahit dán barggu go &#269;állinbeavddis <strong>Ctrl+I</strong>. Dát kommándo rahpá <em>Sisafievrrit leksikona</em> gulahallanbovssa.</p> 
<p>Vuosttažin válljet fiilla mas leat sánit. Sáhtát sisafievrridit <em>.dic</em>-fiillaid (Acapela binára fiilahámi) ja <em>txt</em>-fiillaid (tabuláhtorjuhkkojuvvon teakstafiillaid). </p> 
<p>Ii leat vejolaš sisafievrridit binára Acapela hámi ovtta giellajoavkkus nuppi giellajovkui. Teakstafiillain fertejit leat rievttes kodat. </p> 
<p>Jos lea sátni leksikonas maid áiggut sisafievrridit ja dat gávdno ovddežis leksikonas, muhto das lea earálágan transkripšuvdna, de boahtá jearaldat háliidat go dán sáni bidjat infovox4 leksikonii. </p> 
<p>Ovdalgo sisafievrrideapmi álggahuvvo, de &#269;ájehuvvo konfliktalistu. Juohke elemeanttas mii lea listu, sáhttá válljet barggu ja mearridit makkár sáni háliidat geavahit leksikonas. </p> 
<p>Deaddil <em>Buhtte </em>go áiggut lonuhit sáni mii gávdno o&#273;&#273;a sániin leksikonas maid sisafievrridat. Deaddil <em>Divtte orrut rievdatkeahttá</em> jos háliidat vurket ovddeš jietnadeami, jos ovdamearkka dihte it háliit geavahit jietnadeami mii lea sisafievrriduvvon fiillas. </p> 
<p>Sáhtát maiddái dahkat globála válljejumi. Go deaddilat <em>Divtte visot sániid orrut rievdatkeahttá</em> de doalaha álohii sániid mat leat jo leksikonas, ja ii &#269;álihuvvo dáid badjel. Jos šaddá konflikta ja don álohii válljet sáni sisafievrriduvvon fiillas, de sáhtát dán proseassa dahkat álkibut go deaddilat <em>Buhtte visot. </em></p> 
<p>Boallu <em>Gaskkalduhte sisafievrrideami </em>gaskkalduhttá sisfievrridan proseassa ja manná ruovttoluotta das mo leksikona lei ovdalgo leksikona sisafievrridemiid jearaldat bo&#273;ii.</p> 
<p>Go lea sáhka boasttu fonehtalaš sániin sisafievrriduvvon teakstafiillas, &#269;ájehuvvo boasttuvuo&#273;a diehtu. Boasstu fonehtalaš sánit eai biddjo leksikonii. </p> 
<h2>
<a name="Menus"></a>
<a name="_Toc413655752">Válljenvejolašvuo&#273;at</a></h2> 
<p>Dán oasis geavaheaddji gávdná fállosiid &#269;ilgehusaid mat gusket Pronunciation Editor prográmmii. </p> 
<h3>
<a name="FileMenu">Fiillaid fálus</a></h3> 
<p>Fiila fálus sisttisdoallá standárda fiilabargguid ja sisafievrrideami ja olggosfievrrideami doaimmaid. </p> 
<p>
<a name="SaveLexicon"><strong>Vurke (Ctrl+S)</strong></a></p> 
<p>Vurke kommándo vurke leksikona. Fertet vurket ma&#331;&#331;á go leat o&#273;asmahttán leksikona. Rievdadusat dego o&#273;&#273;a sánit, sihkkut dahje rievdadit jietnadeami sánis, ii váikkut leksikonii ovdalgo leat vurken dan. </p> 
<p>
<a name="ImportLexicon"><strong>Sisafievrrit leksikona (Ctrl+I)</strong></a></p> 
<p>Sáhtát sisafievrridit leksikona sáni teakstafiillas dahje eará Acapela leksikonas. Sisafievrriduvvon leksikona biddjo oktii gustovaš leksikonain. Iská ahte leksikona maid sisafievrridat, lea seammá go giella mii lea aktiiva, mu&#273;ui ii doaimma sisafievrrideapmi. Geah&#269;a 
<a href="#Importing">Sisafievrrideapmi</a> leksikona oasi.</p> 
<p>
<a name="ExportLexicon"><strong>Olggosfievrrit leksikona (Ctrl+Shift+X)</strong></a></p> 
<p>Geavat dán kommándoi go áiggut olggosfievrridit leksikona teakstafiilii dahje leksikonii mii geavaha Acapela standárda leksikona hámi. Geah&#269;a 
<a href="#Exporting">Olggosfievrrideapmi</a> leksikona oasi. </p> 
<p>
<a name="PronunciationEditorFileMenuExit"><strong>Heaittit (Alt+F4, Ctrl+Q)</strong></a></p> 
<p>Dát kommándo heaittiha Pronunciation Editor.</p> 
<h3>
<a name="EditMenu">Doaimmaheaddji fálus</a></h3> 
<p>Dás leat kommándot mat leat oahpás eanaš Windows prográmmain. </p> 
<p>
<a name="EditUndo"><strong>Gá&#273;a (Ctrl+Z)</strong></a></p> 
<p>Dát kommándo gáhtá redigeren bargguid maid leat dahkan ja máhcaha álgoálgosaš stáhtusii. </p> 
<p>
<a name="EditRedo"><strong>Daga o&#273;&#273;asit (Ctrl+Y)</strong></a></p> 
<p>Dát kommándo dagaha o&#273;&#273;asit redigerenbargguid maid gáhtet go geavahit<em> Gá&#273;a</em> kommándo. </p> 
<p>
<a name="EditCut"><strong>&#268;uohpa (Ctrl+X)</strong></a></p> 
<p>Dát kommándo &#269;uohpa eret válljejuvvon teavstta ja vurke &#269;uohppanbeavdái. </p> 
<p>
<a name="EditCopy"><strong>Má&#331;ge (Ctrl+C)</strong></a></p> 
<p>Dát kommándo má&#331;ge sisdoalu &#269;uohppanbeavddi oassái mii lea merkejuvvon. </p> 
<p>
<a name="EditPaste"><strong>Liibme (Ctrl+V)</strong></a></p> 
<p>Dát kommándo bidjá sisdoalu &#269;uohppanbeavddi oassái dasa gosa seaván &#269;ájeha. </p> 
<h3>
<a name="ViewMenu">&#268;ájeheami fálus</a></h3> 
<p>Dás leat kommándot mat gusket die&#273;uide mat bohtet oidnosii Pronunciation Editors. </p> 
<p>
<a name="ShowPhonemesList"><strong>&#268;ájet fonema listtu (Ctrl+P)</strong></a></p> 
<p>Dát kommándo rahpá gova gos &#269;ájeha fonehtalaš mearkkaid mat gullet fonehtalaš transkripšuvdnii. </p> 
<p>
<a name="ShowPhoneticTranscriptions"><strong>&#268;ájet fonehtalaš transkripšuvnnaid (Ctrl+T)</strong></a></p> 
<p>Standárda &#269;ájeheami mielde, ii &#269;ájehuvvo fonehtalaš transkripšuvdna go o&#273;&#273;a leksikonsátni lasihuvvo olgeš &#269;iegas Pronunciation Editors. Jos háliidat oaidnit mo infovox4 jietnadiv&#269;&#269;ii sáni de vállje dán kommándo. Ma&#331;&#331;il go dán leat válljen, rievdaduvvo fáluselemeanta <em>&#268;iega fonehtalaš transkripšuvnna </em>seammá &#269;állinbeavddi jo&#273;ánis boaluin. Seammá barggu sáhtát dahkat jos deaddilat '+' boalu gurut bealde <em>Sáni</em> ja <em>Jietnadeami. </em>Ma&#331;&#331;il go leat deaddilan dáid de '+' rievdaduvvo láhppinmearkkain “-“. </p> 
<h3>
<a name="LexiconMenu">Leksikona fálus</a></h3> 
<p>Dán fállosis leat kommándot mat geavahuvvojit leksikona o&#273;asmahttimii. </p> 
<p>
<a name="AddWord"><strong>Lasit sáni (Ctrl+A)</strong></a></p> 
<p>Dát kommándo molso redigerensaji álgoálgosažžan ja leksikonii sáhttá bidjat o&#273;&#273;a sáni. </p> 
<p>
<a name="DeleteWord"><strong>Sihko sániid(Ctrl+D, Delete, Backspace)</strong></a></p> 
<p>Dát kommándo sihko válljejuvvon sáni leksikonas.</p> 
<p>
<a name="DeleteAllWords"><strong>Sihko buot sániid (Ctrl+Shift+D)</strong></a></p> 
<p>Dát kommándo sihkku buot sániid leksikonas. Don it sáhte gáhtat go leat sihkkon buot sániid, danin rahppo gulahallanboksa Pronunciation Editoras gos geavaheaddji galgá duo&#273;aštit dán doaimma. </p> 
<p>
<a name="PlayOriginalWord"><strong>&#268;uojat álgoálgosaš sáni (F2)</strong></a></p> 
<p>Dát kommándo &#269;uojaha sáni mii &#269;ájehuvvo <em>Álgoálgosaš sáni</em> sajis. </p> 
<p>
<a name="PlayNewPronunciation"><strong>&#268;uojat o&#273;&#273;a jietnadeami (Alt+F2)</strong></a></p> 
<p>Dát kommándo &#269;uojaha sáni maid aiddo lea &#269;állán <em>O&#273;&#273;a jietnadeami</em> sadjái. </p> 
<p>
<a name="CopyWordTranscription"><strong>Má&#331;ge sátnetranskripšuvnna(Ctrl+K)</strong></a></p> 
<p>Dát kommándo má&#331;ge fonehtalaš transkripšuvnna <em>Fonehtalaš transkripšuvdna</em> sajis <em>O&#273;&#273;a jietnadeami</em> sadjái. Ma&#331;&#331;il go evttohuvvon fonehtalaš strea&#331;ga lea má&#331;gejuvvon, de sáhttá geavaheaddji redigeret dan <em>O&#273;&#273;a jietnadeami</em> sajis. </p> 
<p>
<a name="CopyPronunciationTranscription"><strong>Má&#331;ge jietnadantranskripšuvnna (Ctrl+Up arrow)</strong></a></p> 
<p>Dát kommándo má&#331;ge fonehtalaš strea&#331;gga <em>O&#273;&#273;a jietnadeami</em> sadjái Fonehtalaš transkripšuvnna sajis.</p> 
<p>
<a name="LexiconVoice"><strong>Jietna</strong></a></p> 
<p>Geavat dán kommándo go válljet standárda jiena mii geavahuvvo buot &#268;uojat bargguin Pronunciation Editoras. Dát jietna geavahuvvo go lohká <em>Álgoálgosaš sáni</em> ja <em>O&#273;&#273;a jietnadeami</em>.</p> 
<h3>
<a name="PEWindow">Gova fálus</a></h3> 
<p>Dán fállosis lea dušše okta áhta mii geavahuvvo hálddašit Pronunciation Editor gova.</p> 
<p>
<a name="MinimizeWindow"><strong>Minimere</strong></a></p> 
<p>Dát kommándo minimere Pronunciation Editor gova.</p> 
<h3>
<a name="HelpMenu">Veahkki fálus</a></h3> 
<p>Veahkki fállosa bokte beassá veahkki fiilii, ja Acapela Group interneahta ruovttusiidui. </p> 
<p>
<a name="Content"><strong>Sisdoallu (F1)</strong></a></p> 
<p>Dát kommándo rahpá Veahkki fiilla. </p> 
<p>
<a name="AboutPE"><strong>Pronunciation Editor birra</strong></a></p> 
<p>Dát kommándo álggaha <em>Die&#273;ut</em> gova.</p> 
<p><strong>Giellagiehtagirji</strong></p> 
<p>Kommándo rahpá Giellagiehtagirjji dan gillii maid lea válljen.</p>

<br /> 
<h1>
<a name="TextTags"></a>
<a name="_Toc413655753"></a>
<a name="_Ref413313427"></a>
<a name="_Ref413312815"></a>
<a name="_Text_Tags"></a>Teakstamearkkat</h1> 
<p>infovox4 geavaha <em>Microsoft SAPI 4 tag pattern</em> go lohká spesifiserejuvvon die&#273;uid teavsttas. Sapi4 tags &#269;uvvot dáid oppalaš syntáksa njuolggadusaid: </p> 
<p>
<a name="d0e2886"></a>
<a name="d0e2887">· Buot kodat álget ja loahpahit gávusázuin ( \ ).</a></p> 
<p>
<a name="d0e2890">· Finjusázu ii oažžu geavahit koda siskkobealde.</a></p> 
<p>
<a name="d0e2893">· Kodaid leat case-insensitiv. Ovdamearkka dihtii lea, <em>\RST\</em> seammá go <em>\rst\</em> dahje <em>\Rst\</em>.</a></p> 
<p>
<a name="d0e2905">· Kodat gáibidit whitespace. Ovdamearkka dihtii, <em>\Rst\</em> ii leat seammá go <em>\ Rst \</em>.</a></p> 
<p>
<a name="d0e2914">· Go válddát mielde gávusázu merkejuvvon tekstii, muhto lea olggobealde ovtta koda, de geavahit duppal gávusázu ( <em>\\</em> ). Jos geavaheaddji háliida fiilanama mii lohko ná <em>c:\windows\system\test.txt</em>, de ferte duppalastit gávusázuid, ovdamearkka dihtii <em>c:\\windows\\system\\test.txt</em>.</a></p> 
<p>
<a name="d0e2926">· Go mohtor deaivá koda maid ii ádde, de koda ii lohko.</a></p> 
<p>
<a name="d0e2929">· Kodat &#269;uvvot ovtta teavsttas nuppi tekstii. Ovdamearkka dihtii, jos </a>\spd=150\ lea teavsttas, de lohká buot teavsttaid 150 sáni minuhtas, dassái go eará koda boahtá dahje giella rievdaduvvo. </p> 
<p>Dán kapihttalis gávnnat vel listtu kodaid badjel mat leat infovox4.Sáhtát álkidit geah&#269;&#269;alit kodaid SpeechCreatoris, geah&#269;a kapihtal 
<a href="#SpeechCreator">SpeechCreator</a>.</p> 
<h2>
<a name="Tagsdescription"></a>
<a name="_Toc413655754">Kodaid/mearkkaid &#269;ilgehus</a></h2> 
<h3>
<a name="Pau">\Pau=number\</a></h3> 
<p>Dát koda bidjá bottu jitnii nu go lea spesifiserejuvvon millisekunddaide. </p> 
<p>Ovdamearka:</p> 
<p>I am \Pau=2000\ ready.</p> 
<p>Guovtte sekundda boddu lea biddjon<em> am</em> sáni ma&#331;ábeallai. Sáhttá bidjat bottu gitta 10 sekundda rádjai. </p> 
<h3>
<a name="Prn">\Prn="phonetic string"\</a></h3> 
<p>Dáinna kodain sáhttá geavaheaddji teavstta mearriduvvon jietnadeami syntetiseret. Áidna mearkkaid maid sáhttá geavahit leat mearkkat mat leat fonemalisttus. Dáid sáhttá rahpat Pronunciation Editoras. Geah&#269;a kapihttala 
<a href="#PronunciationEditor">Pronunciation Editor</a> eanet die&#273;uid dán birra. Dán koda sáhttá geavahit dušše go bidjá ovtta sáni tekstii. Sáhttet vuorddekeahttá meattáhusat šaddat (prosodi meattáhusat) jos bidjá stuorát ovttadagaid.</p> 
<p>Ovdamearka:</p> 
<p>I will say: \Prn=h @ l @U\</p> 
<p>Lea seammá go <em>I will say: hello</em>.</p>

<table> 
<tbody>
<tr> 
<td> 
<p>
<a name="d0e2989">
<img src="images/image010.jpg" width="24" height="24" /></a></p> </td> 
<td> 
<p>Mearkkašupmi: Dát koda ii láhtte nu go standárda SAPI 4 norbma go dát ii automáhtala&#269;&#269;at geavat seammá jietnadeami boahttevaš sániide.</p> </td> </tr> </tbody></table> 
<h3>
<a name="Spd">\Spd=number\</a></h3> 
<p>Dát koda bidjá gaskamearálaš Hallan-jienaleavttu dan spesifiserejuvvon lohkui minuhttii. Juohke jienas lea standárdaleaktu (sullii 180 sáni minuhttii, sorjavaš makkár jietna lea). Geavat \Rst\ mearkka bidjat leavttu ruovttoluotta standárdaleaktun. </p> 
<h3>
<a name="Rst">\Rst\</a></h3> 
<p>Dát koda bidjá mohtora ruovttoluotta standárdaválljejumiid gustovaš jienas. </p> 
<h3>
<a name="RmS">\RmS=number\</a></h3> 
<p>Bidjá lohkanmodusa, stáve juohke bustávva juohke sánis (number=1), dahje heaittiha dan (number=0). </p> 
<h3>
<a name="RmW">\RmW=number\</a></h3> 
<p>Bidjá lohkanmodusa ahte guo&#273;&#273;á bottuid maid sáhttá gullat juohke sáni gaskii (number=1), dahje heaittihat dán (number=0). </p> 
<h3>
<a name="Equ">\Equ=Preset\</a></h3> 
<p>Rievdada jietnadássejeaddji ovdagihtii válljejumiid go lea jo&#273;us. Sáhtát hálddašit ovdagihtii válljejumiid listtu Voice Manager bokte, geah&#269;a 
<a href="#VoiceManager">Voice Manager</a>.</p> 
<h3>
<a name="Vce">\Vce=charact=value\</a></h3> 
<p>Juohke “charact” sáhttá leat giella dahje hállan. </p> 
<p>Dát koda rievdada hálli dahje giela spesifiserejuvvon árvvu. Geah&#269;a &#269;uovvovaš ovdamearkka:</p> 
<p>
<a name="d0e3056"></a>
<a name="d0e3057">\vce=speaker=Sarah\ Hallo, ich heisse Sarah.</a></p> 
<p>
<a name="d0e3063">\vce=speaker="Ryan"\ Hi, my name is Ryan.</a></p> 
<p>
<a name="d0e3069">\vce=language="German"\ Hallo, ich spreche Deutch.</a></p> 
<p>
<a name="d0e3075">\vce=language=American English\ Hi, I speak American English.</a></p> 
<p>Vaikke makkár jietna lei ovdal válljejuvvon, de vuosttaš cealkaga lohká Sarah. Nubbi cealkaga lohká Ryan. Jos jienanamma mii lea spesifiserejuvvon árvun ii sáhte válljet de ma&#331;imuš jiena válljejumit jotkojuvvojit. Goalmmát cealkka ovdamearkkas lea Duiska gillii ja ma&#331;imuš cealkka Amerihká ea&#331;galasgillii. Vce kodat doibmet albma láhkai jos spesifiserejuvvon gielaid sáhtte válljet. Mu&#273;ui joatká ma&#331;imuš giela válljejumiin. </p> 
<p>Nu go oainnát ovdamearkkas de sáhttá válljet geavaha go aisttonmearkkaid go áigu árvvu &#269;ilget. </p>
</body>
<html>
